{
  "books": [{
      "chapter": "封面",
      "title": ""
    },
    {
      "chapter": "引言",
      "title": "",
      "sections": [{
          "title": "天才存在嗎",
          "content": "為什麼有些人對他們所做的事情如此擅長，擅長到令人不可思議的地步？不論你觀察哪個行業或領域，從競技體育、音樂表演，到科學界、醫學界和商業界，似乎總有幾個非同凡響的人，讓我們對他們能做的事情以及傑出的程度感到炫目。當我們遇到一個如此非同凡響的人時，往往自然而然地認為，這個人生來就比別人優秀。我們經常說，“他真的很有天賦”，或者“她是真正的天才”。但現實的確如此嗎？對這些在其各自行業或領域表現優異的人，比如運動員、音樂家、棋手、醫生、商人、教師，等等，我研究了30多年。我深入細緻地研究了他們的許多細節，包括他們所做的事情，以及怎樣做事情。我暗中觀察他們、採訪他們，而且測試他們。我探索了這些傑出人物的心理狀態、生理機能以及神經解剖學部分。隨著時間的推移，我漸漸懂得，沒錯，這些人的確有著卓越的天才，它們深藏於他們的能力之中。但是，他們的天才，並非人們通常假定的那種，而且，甚至比我們想象的還要強大。最重要的是，這是一種我們每個人都與生俱來的才能，通過適當的方法，我們也一樣可以充分利用。"
        },
        {
          "title": "莫扎特的完美音高",
          "content": "1763年，年輕的沃爾夫岡·阿瑪多伊斯·莫扎特計劃環歐洲旅行演出。正是這次演出，鑄就了他的傳奇。那一年，莫扎特僅僅7歲，身材矮小得只能勉強看到大鍵琴的頂部，但他用自己演奏小提琴及各種鍵盤樂器的技能，深深地迷住了家鄉薩爾茲堡的觀眾。他演奏的樂器，看上去讓人不敢相信，如此小的孩子居然能演奏。但莫扎特還留有另外一手，甚至讓他那個時代的人更加感到震驚。我們知道他的這種更令人震驚的天才，是因為在莫扎特及其家人離開薩爾茲堡開始旅行演出之前不久，莫扎特父親的故鄉奧格斯堡的報紙上發表了一封寫給編輯的信，信中談到了年幼的莫扎特。信的作者寫道，年幼的莫扎特聽到某種樂器演奏出來的調子時，不論是哪種調子，馬上便能準確地辨別出來：是高於中央C音的第二個八度音的升A調，還是低於中央C音的降E調。莫扎特甚至能在某個房間裡聽得出另一間房間裡的人彈奏的調子，而且，他不但能分辨小提琴和古鋼琴演奏出來的調子，還能分辨任何一種樂器的調子。莫扎特的父親是一位作曲家，也是一位音樂教師。他的家裡擺滿了各種各樣的樂器，只要是大家可以想象到的，幾乎應有盡有，而且不僅僅是樂器。莫扎特這個小孩，還可以分辨任何足夠像音樂的聲音的調子，比如時鐘的報時、大鐘的鳴響，以及人們打噴嚏的聲響。在當時，大多數已成年的音樂家，即使是經驗最豐富的，也無法與莫扎特匹敵。他在這方面的奇才，甚至比起他在鋼琴和小提琴上的才華，更能表現出他天生就有的那些神奇才能。當然，如果放在今天，這種能力並非如此高深莫測。比起250年前，今天的我們，不但知道的東西更多，而且大多數人，至少都聽過那些音調。在音樂上，“絕對音高”（absolute pitch）是個技術術語[更多的人稱之為“完美音高”（perfect pitch）]。它異常罕見，大約在每萬人中，只有1個人具備這種能力。這種能力在世界級的音樂家之中，比在我們普通人之中更加罕見，甚至在樂器演奏名家中，也非同尋常：人們認為，這種能力，貝多芬有，勃拉姆斯卻沒有；弗拉基米爾·霍洛維茨有，伊戈爾·斯特拉文斯基卻沒有；弗蘭克·辛納屈有，邁爾斯·戴維斯卻沒有。簡而言之，這似乎是一個絕好的例子，證明某種與生俱來的天賦，往往只有少數一些幸運的人才會天生擁有，其他大多數人並不具備。事實上，至少在200多年的時間裡，人們普遍是這麼認為的。但在過去的幾十年裡，人們對完美音高的理解，出現了極大的差異。如今，人們對完美音高的理解，直指我們人類另一種不同的才華，而不是純粹音樂方面的才華"
        },
        {
          "title": "“天才”是訓練的產物",
          "content": "只是在最近，神經系統科學家才開始懂得，為什麼存在那樣的才華。數十年來，科學家相信，我們的大腦天生就帶有一些極其固定的迴路，而這些迴路決定了我們的能力。你的大腦，要麼對完美音高十分適應，要麼不適應，而且，你沒有太多的辦法去改變它。你可能需要一定程度的訓練，將那種天生的才華充分提升，而且，如果沒有獲得這樣的練習，你的完美音高也許不會得到充分的發揮，但人們一般認為，如果你天生就不具備適當的基因的話，練得再多，也無濟於事。但是，自20世紀90年代以來，研究大腦的研究人員開始意識到，大腦（甚至是成年人的大腦）比我們想象的具有更強的適應能力，這使得我們可以在很大程度上控制大腦能做的事情。特別是，大腦採用以各種方法“重新佈線”的方式，對適當的觸發因子做出響應。神經元之間構成了新的連線，同時，現有的連線要麼得到強化，要麼被弱化，在大腦的某些部分之中，甚至還可能生長新的神經元。這種適應能力，解釋了榊原彩子的研究物件以及莫扎特怎樣培育和提升完美音高：他們的大腦通過發展特定的、能夠擁有完美音高的迴路，對音樂訓練做出響應。迄今為止，我們尚不能辨別那些迴路都是些什麼迴路，也不能說它們看起來是什麼樣子，或者它們到底在做些什麼，但我們知道，它們一定在那裡，而且知道，它們是訓練的產物，並不是某些天生的基因。在完美音高的案例中，當孩子過了6歲以後，大腦的必要的適應能力就會消失，因此，如果完美音高必備的重新佈線還沒有出現的話，那麼，它將永遠消失。（不過，正如我們將在第8章描述的那樣，也有一些例外的情況，讓我們能夠深入瞭解人們如何充分地利用大腦的適應能力）。這種消失，是一種更寬廣現象中的一部分，也就是說，年輕人的大腦和身體的適應能力比成年人更強，因此，有些能力只能在6歲、12歲或18歲之前培養，或者在這些年齡之前更容易培養。儘管如此，在我們整個成年時期，身體和大腦依然都保留著極大的適應能力，這種適應能力，使得成年人甚至老年人也可能通過正確的訓練，培養各種新的能力。天才更懂得利用大腦的適應能力牢記這一點，讓我們回到我在開篇時提出的問題：為什麼有些人對他們所做的事情如此擅長，擅長到令人不可思議的地步？我在對各個不同行業或領域的專家進行的多年研究中發現，他們全都以和榊原彩子的學生同樣的方式培養了自己的能力，也就是說，通過專注的訓練促使大腦改變（有時候根據人們的能力不同，還可以促使身體上的改變），那些改變使得他們能夠做到在正常情況下可能做不到的事情。沒錯，在某些案例中，基因遺傳確實也很重要，特別是在身高或其他生理因素十分重要的領域或行業。比如，某位男性的身高基因為165釐米左右，那麼，他可能發現自己很難成為一位職業籃球運動員；同樣，一位身高接近183釐米的女性，將會發現自己事實上不可能成為一名具有較高水準的藝術體操運動員。同時，如我們將在本書後面的內容中討論的那樣，基因可能還以許多其他的方式影響著某人的成就，特別是那些影響著某人有多大的可能勤奮並正確地練習的基因。但從數十年的研究中發出的清晰訊號是：不論基因遺傳可能在“天才”取得的成就中發揮著什麼作用，這些人擁有的重要才華，與我們每個人都擁有的才華是一樣的。也就是說，他們和我們一樣，大腦和身體都具有適應能力，只是比我們更多地利用了那一能力而已。如果和那些傑出人物交談一番，你會發現，他們全都在某種程度上理解這一點。他們也許對認知適應的概念不太熟悉，但很少接受這樣的觀點：他們在自己行業或領域中達到巔峰，是因為他們遺傳了優秀的基因。他們知道，培養卓越的技能，是因為他們首先就具有了那些方面的豐富經驗。在這個主題上，我最喜歡的證據是曾十次入選NBA全明星陣容、聯盟歷史上最偉大三分射手的雷·阿倫（Ray Allen）。多年前，ESPN評論員傑奇·麥克馬蘭（Jackie MacMullan）曾寫過一篇關於雷·阿倫的文章，那時，後者即將創造三分籃的歷史紀錄。在說到雷·阿倫的故事時，麥克馬蘭提道，另一位籃球評論員曾說，雷·阿倫天生就是三分王。換句話講，他具有三分射手的天賦。但雷·阿倫並不贊同這種說法。他告訴麥克馬蘭，“我和身邊的許多人圍繞這個話題爭論過。當人們說，上帝賜予我傑出的稟賦，讓我在比賽中完成漂亮的三分跳投時，那真是氣死我了。我告訴這些人，‘不要低估我每天付出的巨大努力。’不是一天兩天，是每一天。問一問我曾經的隊友，哪個人在訓練投籃的時候最為刻苦。回到西雅圖和密爾沃基，問一問那些球員們。他們的回答一定是我。”事實上，正如麥克馬蘭說過的那樣，如果問過雷·阿倫高中籃球隊的教練，你會發現，雷·阿倫在高中時代的跳投，並不比其他隊友更出色；事實上，他的表現還很差。但他不向命運低頭，而是掌控著自己的命運，一直在心無旁騖地刻苦訓練。隨著時間的推移，他將自己的三分跳投訓練得如此嫻熟自然，動作優美，以至於人們以為他天生就是個傑出的三分射手。他只是利用了他的天才，他真正的天才。"
        },
        {
          "title": "本書將告訴我們什麼",
          "content": "本書描述莫扎特、榊原彩子的研究物件以及雷·阿倫等人共同擁有的才華，也就是說：通過正確的訓練與練習進行創造的能力。這種能力與才華，只有通過利用人類的大腦與身體不可思議的適應能力，才可能擁有。此外，本書還闡述了這樣一個觀點：為了提高人們在選擇的行業或領域中的表現和水平，每一個人能以怎樣的方式將其才能發揮出來。最後，本書最廣泛的意義在於，它介紹了一種關於人類潛力的新思考方式，提醒著我們：我們擁有更大的力量來掌控自己的人生，但我們以前卻從來沒有意識到。自遠古時代開始，人們通常以為，某個人在任何特定行業或領域內的潛力，不可避免地受到天生才能的限制。上鋼琴課的人很多，但只有那些有著特殊天才的人們才可能成長為真正偉大的鋼琴家或作曲家。每個孩子在學校裡都上數學課，但只有少數一些人長大後能成為數學家、物理學家或工程師。根據這種觀點，我們每個人一生下來，都具有一些固定的潛力，有的具有音樂潛力，有的在數學方面有天賦，有的生來就適合體育運動，有的天生精於商道，我們可以選擇發展（或者不發展）那些潛力中的任何一種，但不可能填補那些特定的“缺陷”。因此，教育或訓練的目的變成了幫助人們發揮他的潛力，以便儘可能充分地填補那些缺陷。這意味著，可以採用一種特定的方法來進行那種假設了預定極限的學習。但我們現在知道，這種預先確定的能力並不存在。大腦是可適應的，而訓練可以創造一些我們以前並未擁有的技能（比如完美音高）。這是具有顛覆意義的觀點，因為如今的學習變成了一種創造能力的方式，而不是使人們能學會充分利用他們的內在才華。在這個全新的世界，認為人們天生就具有一些固定潛力的觀點已經站不住腳了；相反，潛力好比可延伸的血管，能夠通過我們一生中經歷的各種各樣的事情來創造。學習不再是挖掘某人潛力的方式，而是發展這種潛力的方式。我們可以創造自己的潛力。無論我們的目的是成為鋼琴家，或者只求自娛自樂，能彈得一手漂亮的鋼琴，是加入美國職業高爾夫巡迴賽，或者只為了能打幾個好球，都是這麼回事。那麼問題來了：我們怎麼做到？我們怎麼充分利用這種才華，並在我們選擇的行業或領域中塑造我們的能力？過去幾十年間，我的大部分研究一直致力於回答這個問題，也就是說，致力於辨別和理解提高我們在某種特定活動中表現和水平的最佳方法。簡單地講，我一直在問，哪些方法管用？哪些方法不管用？為什麼？令人震驚的是，絕大多數曾圍繞這個普遍主題著書立說或者發表評論的人，幾乎沒有關注過這個問題。過去幾年裡，許多作者在他們寫的書中認為，我們一直過於高估了天生才能的作用，低估了諸如機會、動機和努力的價值。我十分同意這種觀點，而且，讓人們知道他們可以通過練習來提高，並且大幅度地提高，一定十分重要。否則，他們可能連試一下的動機都沒有。但有些時候，這些書籍給人們留下的印象是：光靠真誠的願望與刻苦的努力，就足以提高了，“只要你努力朝前奮進，終將達到目標”。但這也是錯誤的。在足夠長的時間內進行正確練習，可以實現改進。再無其他。本書詳細地描述了“正確的練習”是什麼，以及可以怎樣發揮它的作用。我們從一個相對較新的心理學領域中找到了涉及這種練習的細節，最好是將這個領域描述為“專業特長科學”。這個新的領域著眼於理解“傑出人物”的能力，所謂“傑出人物”，就是那些在他們所從事的行業或領域中表現最突出的人們，以及那些登上了巔峰的人們。同時，我還發表了關於這一主題的幾本學術專著，包括1991年出版的《從平庸到卓越：前景與侷限》（Toward aGeneral Theory of Expertise：Prospects and Limits），1996年的《通向卓越之路》（The Road to Excellence），以及2006年的《劍橋專業特長與傑出表現指南》（The Cambridge Handbook of Expertise and Expert Performance）等。我們中那些在這一專業領域（指前面提到的“專業特長科學”的領域）從事研究的人，調查了是什麼因素使這些傑出人物從其他人中脫穎而出。我們還嘗試著逐步研究這些專家級的傑出人物如何隨著時間的推移而提高他們的表現和水平，以及他們在提高的時候，其心理和生理能力出現了怎樣的改變。20多年前，在研究了一系列行業或領域中的專家級人物之後，我的同事和我開始意識到，不論在什麼行業或領域，提高表現與水平的最有效方法，全都遵循一系列普遍原則。我們把這種通用的方法命名為“刻意練習”（deliberate practice）。如今，對於在任何一個行業或領域中，希望充分利用人們的適應能力這種才能來學習新的技能與能力的所有人來講，刻意練習依然是黃金標準，而且，它是本書的核心內容。本書的前半部分描述了刻意練習是什麼，為什麼管用，以及傑出人物如何運用它來發展傑出的能力。為了做好這些，我們必須研究各種不同型別的練習，從最簡單的到最複雜的，並探索它們之間的差別。不同型別的練習的關鍵差別在於，它們對人類的大腦和身體的適應能力的利用程度各不相同，因此，我們將花一些時間來探討那種適應能力，以及是什麼觸發了那種能力。我們還探究，到底我們的大腦發生了哪種變化來響應刻意練習。獲取專業特長，很大程度上是改進人們的心理過程（在某些行業或領域中，還包括改進那些控制著身體運動的心理過程），而且，人們已經很好地理解了身體功能的變化（比如力量增大、柔韌性增強、耐力增強等），因此，本書著重闡述傑出人物的心理層面，儘管在體育專案以及其他運動專案之中，人們專業特長的提升一定有著明顯的體能要素。在進行了這些探索之後，我們將研究，所有這些要素是如何在傑出人物的身上融合到一起的。這種融合是個漫長的過程，通常需要10年之久，甚至更長的時間。接下來，在簡短的插曲中，我們更仔細地研究了先天稟賦的問題，以及這個問題可能怎樣限制了有些人在追求卓越時走得多遠。我們有些生理特徵確實是天生的，比如身高和體形，它們可能影響在各個體育專案以及其他體育活動中的表現，而且無法通過練習來改變。不過，更多的特點在傑出人物的卓越表現中發揮著作用，而它們是可以通過正確的練習來改變的，至少在人們一生中的某個階段可以改變。更一般地講，遺傳因素與練習活動之間存在著複雜的交織，而我們才剛剛開始瞭解。有些遺傳因素可能影響一個人投入到持久的刻意練習之中去的能力，例如，遺傳因素有可能限制某人每天都長時間集中注意力的能力。相反，進行大量練習，可能影響到身體中的基因怎樣開啟和關閉。本書的最後部分，讓我們從對傑出人物的研究中受益，特別是對刻意練習有了深入的瞭解，並解釋了這對我們其他人來說到底意味著什麼。圍繞怎樣將刻意練習應用到專業組織中的工作，以提高員工的績效，我提了一些具體的建議，同時還建議個人可以怎樣進行刻意練習，以便在他們感興趣的行業和領域中變得更加優秀，甚至還就學校可以怎樣在課堂中應用刻意練習提出了建議。儘管刻意練習的原則是通過研究傑出人物發現的，但這些原則本身，可以由任何立志於改進任何事情的人們所使用，即使只是稍稍改進也無妨。想提高你的網球水平嗎？刻意練習。寫作水平？刻意練習。銷售技能？刻意練習。由於研發刻意練習是專門用於幫助人們變成他們行業或領域中的世界最傑出人物，而不僅僅是變得“足夠好”，因此，這是迄今為止我們發現的最強大的學習方法。你可以從這個角度來思考：假設你想去爬山，你不確定你想爬多高，山路看起來蜿蜒曲折，令人望而生畏，但你知道，你想比現在所處的位置爬得更高一些。你可以簡單地選擇一條看起來很有希望的路徑，並期望是最好的，但你可能走不了很遠。或者，你可以依靠一個曾登上過頂峰、並瞭解最佳路線的嚮導，不論你決定自己要爬多高，這會保證你以最有效的方式登山。這種最佳的方法就是刻意練習，而本書就是你的嚮導。本書將向你顯示登上巔峰的路徑；至於在那條路徑上能走多遠，則取決於你自己。"
        }
      ]
    },
    {
      "chapter": "第1章",
      "title": "有目的的練習",
      "sections": [{
          "title":"有目的的練習",
          "content": "我們剛剛進行到第四次練習，史蒂夫·法隆（Steve Faloon）似乎開始洩氣了。那是我做的一個實驗剛剛進行到第一個星期的星期三時的情形。我起初預計，實驗將持續兩三個月之久。但從史蒂夫對我說的話裡，我能感到這個實驗似乎沒什麼太大的意義進行下去了。他對我說：“我的極限似乎在8個數字或者9個數字。”我當時對他說的話錄了音，並且在我們每次上課的時候都會播放。他繼續說，“特別是9個數字，不管我採用什麼方法來記，都很難記住。你知道，我有我自己的方法。但無論我用什麼方法，似乎都不重要了——太難了。”史蒂夫是卡內基梅隆大學的學生，我在那裡教書的時候，曾聘請他參加這個實驗。他一星期和我見幾次面，任務很簡單：記住一串數字。我以大約每秒一個數字的速度，向他讀出一串數字，“7…4…0…1…1…9”，諸如此類，史蒂夫則努力記住所有那些數字，並在我念完之後，把數字背給我聽。實驗的目的是看一看史蒂夫能在多大程度上通過練習來提高記憶。現在，我們進行了四次練習，每次練習1小時，他能穩定地記住7個數字了，也就是說，能夠記住當地的一個電話號碼。通常情況下，他也可以記住8個數字，但如果是9個數字，就有些記住不了。他還根本沒去想記住10個數字組成的數字串。此刻，鑑於他在前幾次練習裡已經倍感失敗，他十分確定，他再也不可能有任何提高了。"
        },
        {
          "title": "史蒂夫的超強記憶力",
          "content": "史蒂夫不知道（但我知道）的是，那個時候，絕大多數的心理學研究成果認為，他說的是對的。根據數十年的研究成果顯示，人們可以保留在短時記憶中的事物數量，有著嚴格的限制，這也正是大腦用來在短時間內記住少量資訊的那種型別的記憶。如果某個朋友給你他的地址，在你把它寫下來之前，你的短時記憶只能記住一段時間。或者，如果你在心裡將好幾個兩位數的數字相乘，你的短時記憶就是你能保持追蹤所有中間片斷的位置：“讓我們來看：14乘以27……首先，四七二十八，因此，個位是8，十位是2，然後，二四得八……”，依此類推。這就是它被稱為“短期”的原因。除非你花時間一遍一遍地對自己重複，並因此將其轉移到你的長時記憶之中，否則，過了五分鐘，你不會記得住朋友的地址或者那些中間的數字。短時記憶的問題，也正是史蒂夫面臨的問題，那便是：我們的大腦對於可以將多少事物立即儲存在短時記憶中，有著嚴格的限制，這一限制通常約為7件事物，也就是說，大腦足以記住一個當地的電話號碼，但記不住社會保險號碼。長時記憶則不存在這些限制（事實上，到目前為止，還沒有人發現長時記憶的上限），但它要花很長的時間來進行。如果給你足夠長的時間來記，你可以記住十幾個甚至數百個電話號碼，但我和史蒂夫進行的實驗，設計的目的是快速地說出數字，迫使他只能運用短時記憶。我在讀那些數字的時候，是以每秒鐘1個數字的速度，使得他很難將其轉移到長時記憶中去，因此，在記到大約8位數字或9位數字的時候，他覺得再也記不住了，這一點兒也不足為奇。儘管這樣，我仍希望他能做得更好一點兒。我之所以要進行這次研究，是因為我在搜尋一些古老的科學研究時，發現了一篇默默無聞的論文。論文發表在《美國心理學期刊》（American Journal of Psychology）1929年那一期上，由賓夕法尼亞大學兩位心理學家保琳·馬丁（Pauline Martin）和薩繆爾·費恩伯格（Samuel Fernberger）撰寫。馬丁和費恩伯格指出，他們的實驗物件，即兩名大學生，在經過4個月的練習之後，能記住的數字數量增多了，即使他們聽到的數字大約是以每秒鐘1個數字的速度讀出。經過長期練習之後，他們能記住更多的數字。其中的一個學生將平均9個數字增加到13個，另一個學生則從11個數字增加到15個數字。一直以來，心理學研究界忽略或遺忘了這一研究結果，但我馬上關注起來。這種提高真的可能嗎？如果可能，怎樣變成可能的？馬丁和費恩伯格並沒有提供任何細節來描述那兩位學生究竟如何提升他們對數字的記憶，但恰好是這個問題，引起了我最大的興趣。看到他們的研究成果時，我剛剛從大學畢業，當時最感興趣的是，當人們在瞭解某些事情或提升某項技能時，其心理過程會發生什麼。為了寫好我的畢業論文，我精心準備了一個被稱為“有聲思維協議”（the think-aloud protocol）的心理學研究工具，它專門用於研究那些心理過程。因此，在和卡內基梅隆大學的知名心理學教授比爾·蔡斯（Bill Chase）合作時，我開始重新進行馬丁和費恩伯格的研究，這一次，我打算觀察，假如我們的研究物件真的提升了的話，他到底怎樣提升了對數字的記憶。持續練習，突破極限我們招聘的實驗物件是史蒂夫·法隆，在我們期待著找到他時，他只是一名普通的大學生。那時他剛唸完大三，主修心理學，對兒童早期發展感興趣。他的學業測試上的成績與卡內基梅隆大學的其他學生相差無幾。他個子瘦高，長著濃密的深棕色頭髮，待人友善、性格活潑、熱情四射。此外，他還堅持長跑。這一事實，當時似乎對我們的實驗沒有任何意義，但後來證明卻至關重要。史蒂夫第一天來參加記憶力的實驗時，表現完全是正常的水平。他通常可以記住7個數字，有時候是8個，但不會再多。如果你從街上隨便找個人來做實驗，可能他的表現和史蒂夫第一天的表現一模一樣。到了星期二、星期三和星期四，他稍稍好一些了，平均恰好能記住9個數字，但依然不比普通人優秀。史蒂夫說，他覺得後面這幾天和第一天相比，主要的差別在於，他知道自己可以預料到記憶測試會是什麼結果，因而感到更加舒服。到了星期四的訓練結束時，史蒂夫向我解釋了為什麼他覺得自己不可能再有所提高了。接下來，星期五發生的一些事情，改變了一切。史蒂夫找到了突破的方法。我和他練習的方法是這樣的：我首先從一個隨機的、有5個數字的數字串開始，如果史蒂夫記住了（他做到了這點），我會讀6個數字。如果他又記住了，我再增加到7個數字。依此類推。每次給數字串上增加1個數字，他都可以記住。如果他記錯了，我會將數字串的長度縮短2個數字，然後再繼續。史蒂夫時刻都在以這種方法接受挑戰，但挑戰難度並不是太大。我給他念的數字串，恰好處於他能記住與不能記住的界限。到那個星期五，史蒂夫就越過了他原本以為的自己的極限。在此之前，只用訓練幾次，他便能正確記住9個數字的數字串，但他從來沒有正確無誤地記住過10個數字的數字串，因此，一直沒有機會去嘗試記住11個或更多數字。但他在第五次訓練時，開始超常發揮。我們首先試了三次，分別記住5個、6個和7個數字，沒有一點兒問題，到第四次的時候，也就是8個數字的時候，他記錯了，然後再返回來：6個數字，對了；7個數字，對了；8個數字，對了；9個數字，也對了。然後我讀出10個數字的串，5718866610，他也記住了。等到我念出11個數字時，他沒能記住，於是又從9個數字開始重來。他記住了9個數字和10個數字，我再次給他讀出了11個數字的數字串，90756629867，這一次，他毫不費力地把整個數字串背了下來。那比他之前能夠記住的數字多了兩個，儘管另外增加兩個數字，看起來似乎不是特別令人印象深刻，但實際上，考慮到史蒂夫在過去的幾天裡確定自己已達到了只能記住8~9個數字的“自然”極限，這已經是巨大的成績了。他找到了突破那一極限的方法。那只是我職業生涯中一段最令人驚奇的旅程的開始。從那時起，史蒂夫開始緩慢而穩定地提高著記住數字串的能力。到第16次練習時，他能穩定地記住20個數字了，遠遠超出比爾和我對他能力的想象。練習了一百多次以後，他的記錄達到了40個數字，比任何人都多，甚至專業研究記憶術的人，也達不到他的水平。而且，他還在不斷進步。史蒂夫和我一同進行了二百次練習，所有這些練習結束時，他能記住82個數字了。82！思考片刻，你會意識到，這種記憶力到底有多麼不可思議。以下是史蒂夫記住的82個隨機的數字：0326443449602221328209301020391832373927788917267653245037746120179094345510355530想象一下，在聽到別人向你以每秒一個數字的速度念出這82個數字，然後你能把它們全部記下來。這是一種什麼樣的情形！但是，在我們的實驗持續兩年左右的時間後，史蒂夫達到了這樣的水平。他甚至不知道自己可以做到所有這些，只是一個星期接著一個星期地持續練習罷了。"
        },
        {
          "title": "各領域的傑出人物都靠大量練習",
          "content": "1908年，約翰尼·海耶斯（Johnny Hayes）奪得奧運會馬拉松冠軍，當時的報紙把這場比賽描述為“20世紀最偉大的比賽”。海耶斯不僅奪冠了，還創造了馬拉松世界紀錄，成績是2小時55分18秒。如今，距離海耶斯奪冠一個多世紀以後，馬拉松的世界紀錄已經重新整理為2小時2分57秒，比他創造的世界紀錄快了近30%，而且，如果你是年齡為18~34歲的男性，想參加波士頓馬拉松比賽，那麼，只有成績不低於3小時5分，才可能獲得參賽資格。簡單地講，海耶斯在1908年創造的世界紀錄，如果換到今天的波士頓馬拉松比賽中，只夠剛剛贏得參賽資格。要知道，這項比賽吸引了大約3萬名長跑者參加。同樣是在1908年的夏季奧運會上，在男子跳水比賽中，幾乎出現了一場災難。其中一位跳水運動員在嘗試空翻兩週這個動作時，差點兒身受重傷。幾個月後釋出的官方報道認為，跳水是項危險的運動，建議未來的奧運會禁止該專案。如今，空翻兩週已成為跳水專案中的入門級動作，即使是10歲的孩子參加的比賽，也必須會這個動作，到了高中，最佳的跳水運動員可以完成空翻四周半的動作了。世界級運動員甚至可以做更加高難的動作，比如迴旋，也就是說，向後空翻兩週半，再加兩週半轉體。我們很難想象，20世紀初期那些認為空翻兩週屬於危險動作的專家，會怎樣看回旋這個動作，但我猜，如果當時有人具有這樣的想象力，猜測到今後的跳水運動會出現類似迴旋的高難度動作的話，那些專家一定會認為這是個笑話，絕不可能做到。在20世紀30年代早期，阿爾弗雷德·柯爾託（Alfred Cortot）是世界上最知名的古典音樂家，他演繹的《肖邦24首練習曲》被認為是權威的演繹。而如今的音樂導師們往往把類似的表演作為反面教材加以批判，批評家們抱怨柯爾託採用的那種粗心大意的彈奏方法，而且，每一位職業鋼琴家在彈奏同樣這些練習曲時，有可能運用比柯爾託嫻熟得多的技能。事實上，音樂批評家安東尼·托馬西尼（Anthony Tommasini）在《紐約時報》上一度發表評論，認為自柯爾託的時代以來，人類的音樂能力得到了大幅度提高，以至於柯爾託當時的水平，如果放在今天，可能連茱莉亞音樂學院的入學考試都通不過。1973年，加拿大人大衛·理查德·斯賓塞（David Richard Spencer）背誦圓周率小數點之後的數字時，創下了前無古人的紀錄：511位。五年之後，好幾個人在一系列比賽中爭著創下新紀錄，結果，這個紀錄最終屬於一位名叫大衛·沙克爾（David Sanker）的美國人，他背誦了圓周率小數點之後的1萬個數字。2015年，該紀錄被塵封了30多年之久以後，來自印度的拉吉維爾·米納（Rajveer Meena）奪得了冠軍，再度創下紀錄，背誦了小數點之後的7萬個數字，這使得他花了整整24小時零4分鐘來背誦。不過，一位名叫原口證（Akira Haraguchi）的日本人聲稱背誦了更令人不可思議的10萬個數字，或者，我們換個角度來想，這一紀錄是42年前的世界紀錄的近200倍！這些例子都不是唯一的。我們生活的這個世界，許多人擁有著超常的能力，那些能力勝過人類歷史上任何時代的人們所擁有的能力，如果“穿越”到以前的時代去，都會被當時的人們認為不可能。想一想羅傑·費德勒（Roger Federer）在網球專案中的神奇表現，或者想一想麥凱拉·馬羅尼（McKayla Maroney）在2012年倫敦奧運會上的驚人一跳：先是一個踺子翻，翻到木馬上方，而後在拱頂處一個後手翻，接著，麥凱拉在木馬的上方高高地、呈弧線地飛起來，完成了兩圈半的轉體，再穩穩地落地，並且完全控制住了自己的身體。有一些著名的國際象棋特級大師能同時進行幾十場比賽，還矇眼進行；而且，似乎總能源源不斷地湧現一些年輕的音樂神童，他們既能彈鋼琴、拉小提琴和大提琴，還能吹長笛，各種樂器信手拈來，如果放到100年前，一定會讓音樂迷們瞪大了眼睛，感到無比震驚。他們練習，大量地練習儘管這些能力非常卓越，但關於這些人如何開發這些超常能力，卻並沒有祕密可言。他們練習，大量地練習。在長達一個世紀的時間裡，馬拉松的世界紀錄並不是因為人們天生就具有長途奔跑的基因而提高了30%。20世紀下半葉出生的人們，也不是因為突然之間擁有了一些天賦，就能彈奏肖邦的曲子或拉赫馬尼諾夫的曲子，或者記住數十萬個隨機的數字了。相反，在20世紀下半葉，我們看到的是，不同行業或領域的人們投入訓練的時長在穩定地增長，同時，訓練方法也日益高階。在許多行業或領域之中尤其如此，特別是那些高度競爭性的領域，比如音樂演奏和舞蹈、體育運動中的個人專案和團體專案，以及其他的競賽。這種在訓練的數量與精細程度上的與時俱進，使不同行業或領域中的人們的能力穩定提高，這種提高，如果逐年來看，並非總是顯而易見，但跨越幾十年的時間，便十分驚人了。在吉尼斯世界紀錄中，你可以看到這種訓練的結果，有時候甚至讓你感到無比奇特。翻開吉尼斯世界紀錄大全，或者訪問其線上版本，你會發現一些世界紀錄保持者的神奇表現，比如美國教師芭芭拉·布萊克伯恩（Barbara Blackburn），她能以每分鐘212個單詞的速度打字；斯洛維尼亞的馬可·巴羅什（Marko Baloh）曾在24小時裡騎單車905千米；而印度的維卡斯·沙馬（Vikas Sharma）只用了僅1分鐘時間，便計算出了12個大數字的方根，每個數字的長度介於20位到41位數字之間，求出的方根從17次方到50次方不等。最後的那次計算，也許是所有計算中最令人印象深刻的一次，因為沙馬能在僅僅6秒鐘內進行12次連續而艱難的心算，這甚至比許多人把數字輸入到計算器中並讀出計算結果的時間還要短。最有效的練習形式我收到過一封由吉尼斯世界紀錄保持者鮑勃J.費舍爾（Bob J.Fisher）寫來的電子郵件，他一度在籃球的自由投籃專案中保持著12項不同的世界紀錄。他的紀錄包括：在30秒鐘之內實現最多次數的自由投籃（33次）、在10分鐘之內最多次數的自由投籃（448次）以及在1小時之內最多次數的自由投籃（2371次）。鮑勃在郵件中告訴我，他看過我撰寫的關於練習效果的研究成果，並將他從那些研究中學到的東西運用起來，以提高自己自由投籃的能力，這使得他比世界上任何人都投得更快。那些研究，全都以我在20世紀70年代末與史蒂夫·法隆所做的實驗為基礎。自那以後，我嘔心瀝血地投入到研究之中，以理解練習到底可以怎樣幫助我們創造新的能力和拓展已有的能力，同時特別關注那些運用反覆不斷的練習，最終成為他們所在行業或領域中世界最佳的人。在對這些優中再優的人們進行了數十年的研究之後（為運用精確的術語，我們把他們叫作“傑出人物”），我發現，不論什麼行業或領域，音樂也好，體育也好，象棋也好，其他任何行業或領域也罷，最有效的那些練習，全都遵循同樣一些普遍原則。那些用來將前途看好的音樂家培養成音樂會鋼琴家的教學方法，與將一位普通舞蹈演員培養成芭蕾舞團首席女演員所採用的方法，或者將一位國際象棋棋手培養成大師所採用的方法，為什麼都有關聯呢？答案是：在任何行業或領域之中，最有效的和最強大的那類練習，都通過充分利用人類的身體與大腦的適應能力，來逐步地塑造和提升他們的技能，以做到一些過去不可能的事情。如果你希望發展一種真正有效的練習方法，比如打造世界級的體操運動員，或者是教出一些能夠進行腹腔鏡手術的醫生，那麼這種方法需要考慮到在促使身體和大腦的改變上，哪些可以奏效，哪些無法奏效。因此，所有真正高效的方法，基本上都以同樣的方式起作用。這些見解全都是相對較新的，而且並非所有在過去一個多世紀裡發揮了令人難以置信的超常表現和取得令人不可思議的進步的導師、教練和選手，都運用了這些見解。相反，他們的進步，都是通過反覆試驗才取得的，參與這些試驗的人們，其實並不知道為什麼某種特定的練習方法可能有效。此外，在各個不同行業或領域中的從業人員，只是各自對他們自己的身體條件有一定的瞭解，並不知道所有這些都相互關聯，比如，全心練習三圈半跳躍的滑冰運動員所遵循的一系列普遍原則，與專心練習莫扎特奏鳴曲的鋼琴家所遵循的原則其實是一樣的。因此，設想一下，如果清楚地瞭解了培養專業特長的最佳方法，可以鼓舞和引導人們怎樣付出努力去追求卓越。同時設想一下，如果我們把在體育、音樂和國際象棋等領域中被證明十分有效的方法運用到其他行業或領域中那些致力於學習和提高的人們身上，從在校學生的教育，到醫生、工程師、飛行員、商界人士，以及各種各樣的員工的培養和提升，等等，可以取得怎樣令人咋舌的卓越業績。我相信，如果我們對有效練習原則進行研究，並且運用從這些研究中得到的經驗，那我們完全可以實現我們曾見證過的、在過去一個多世紀之中各行各業和各個領域的人們取得的令人驚歎的進步。某種程度上，各種各樣的練習都可能有效，但其中一種特殊的形式則是黃金標準，我在20世紀90年代初期稱之為“刻意練習”。這是我們知道的最有效和最強大的練習形式，而且，對刻意練習原則的運用，是為任何行業或領域策劃和設計訓練方法的最佳方式。"
        },
        {
          "title": "從有目的的練習講起",
          "content": "本書中的絕大部分內容將探索刻意練習是什麼、它為何如此有效，以及怎樣在各種不同的情形中運用它。但在我們深入研究刻意練習的細節之時，最好是稍稍花一些時間來了解某些更為基本的練習，也就是大多數人已經在某種程度上經歷過的那種練習。學習新技能的一般方法讓我們首先來看人們一般是怎樣學習某種新技能的，比如開車、彈鋼琴、做長除法、畫人物畫、編寫程式碼，或者許多其他事情。為了列舉一個特定的例子，讓我們假設你在學習打網球。你一定在電視上看過網球比賽，看起來很有趣，或者說，你的一些朋友喜歡打網球，你也想加入他們的行列。因此，你買回了一些網球裝備，包括球鞋、防汗帶、球拍以及球，等等。現在，你決心開始學習，但你不知道打網球的第一件事到底是什麼，你甚至還不知道怎麼握拍，因此，你得花錢去上一些課，聽網球教練進行講解，或者請某位朋友告訴你一些基本知識。你可能還會花一些時間去練習發球，一遍一遍地練習朝牆上擊球，直到你非常確定你可以對著牆來“打比賽”了。在那以後，你再回頭找你的教練或朋友，請他們再教你一次，然後你再花更多時間訓練，之後再上課、再訓練，過了一段時間，你覺得自己可以和別人一起打了。你依然不是很優秀，但你的朋友有耐心，每個人都在幫你提高和進步。你不斷地一個人練習，並且經常吸取一些成功的經驗，隨著時間的推移，你犯那些真正讓你尷尬的錯誤的可能性越來越小了，比如擊不中球，或者在雙打時直接把球打到隊友的後背上，等等。你對每一次擊球都越來越熟練，甚至還可以背後接球了，有時候，當你面對對手凶狠的接球時，能像職業球員那樣漂亮地把球回過去（或者，你對自己說，你感覺就像是職業球員）。你已經達到了一種舒服的境界，可以外出和別人打上幾盤，並且即使是比賽，也感到很有趣。你非常清楚自己在做什麼，每一次擊球，都變成了自然而然的動作。打球的時候，你不必想太多了。所以，隨著每個週末都和朋友打球，你開始喜歡比賽和訓練了。你變成了一位網球運動員。那也就是說，你已經在傳統意義上“學會了”打網球，你的目標就是練到這樣的水平：在球場上，你的所有動作都是自動做出的，你的表現也被人們所接受，不需要太多的思考，如此一來，你可以真正在球場上放鬆，享受比賽。到這個時候，即使你對自己打球的水平並不是徹底滿意，但你的進步是實實在在的。你已經掌握了容易的技能。但你很快便會發現，你依然有一些弱點，不論你多麼經常地和朋友打球，這些弱點總是暴露出來。比如，也許每次用反手來接那種直奔你胸前、稍稍帶點旋轉的球時，你總是接不到。你知道這個弱點，而對手也注意到了這一點，每次都有意打出這種球，逼你失誤。對此，你感到挫敗不已。不管怎樣，由於這並不會經常發生，而且你永遠不知道對手什麼時候打出這種球來，因此，你沒有機會繼續去改進，每次面對這種球，你總是以幾乎一模一樣的方式漏接這種球。在我們學習任何一項技能時，從烘餅乾到寫一段說明文，我們全都遵循很大程度上相同的模式。首先，一般性地瞭解我們想做些什麼，從導師、教練、書籍或網站上獲得一些指導，然後開始練習，直到我們達到可接受的水平，接下來，讓這種技能變成自動的、自然而然的。這種方式並沒有錯。我們在生活中所做的事情，很多只需要我們達到中等水平便可以了。如果你想把汽車安全地從甲地開到乙地，或者在彈鋼琴時能熟練彈好《獻給愛麗絲》這首曲子，那麼，你只需要採用這種辦法就行了。但在這裡，你要理解一件非常重要的事情：一旦你已經達到了這種令你滿意的技能水平，而且能做到自然而然地表現出你的水平，無論是開車、打網球還是烘焙餅乾，你就已經不再進步了。人們通常錯誤地理解這種現象，因為他們自以為，繼續開車、打網球或烘焙餅乾，就是一種形式的練習，如果不停地做下去，自己一定能夠更擅長，也許進步較為緩慢，但最終還是會更出色。人們認為，開了20多年車的老司機，一定會比只開了5年車的司機更擅長開車；行醫20年的醫生，一定會比只行醫5年的醫生更優秀；教了20年書的老師，一定會比只教了5年書的老師能力更強。但是，現實並不是這樣。研究表明，一般而言，一旦某個人的表現達到了“可接受”的水平，並且可以做到自動化，那麼，再多“練習”幾年，也不會有什麼進步。甚至說，在本行業幹了20年的醫生、老師或司機，可能還稍稍比那些只幹了5年的人差一些，原因在於，如果沒有刻意地去提高，這些自動化的能力會緩慢地退化。有目的的練習VS天真的練習如果對這種自動化的表現並不滿意，你要做什麼？如果你是一位工作了10年之久的老師，你想做一些事情，讓學生對你上的課更感興趣，並讓你在課堂上更加高效，你該做什麼？你基本上每個週末都打高爾夫球，想再提高一些，該怎麼辦？你在一家廣告公司擔任打字員，想讓別人對你的打字速度感到驚歎，又該怎麼辦？這便是史蒂夫·法隆在經過幾次練習之後發現他自己所處的情形。在那一刻，他對自己能夠聽到一串數字、把它們記下來，然後再念給我聽等，感到很滿意，而且，由於大家知道，短時記憶存在侷限，所以，他的表現也和人們期望的差不多，中規中矩。他原本可以不停地這樣記下去，在經過一次又一次的練習之後，最多能記住8個或9個數字。但他並沒這樣做。他參加了我設計的這個實驗，而我設計這個實驗的初衷，就是使他持續不斷地接受挑戰，以便每次都能比上次多記住一位數字，同時，也因為他是那種天生就喜歡挑戰的人，所以，他在逼迫自己變得更優秀。他採用的這種方法，我們稱為“有目的的練習”，事實證明，這種方法對他來說是不可思議的成功。正如我們接下來將看到的那樣，這種方法並非總是如此成功，但它比通常的方法更有效一些，而且，這是通向刻意練習的第一步，而我們的最終目標便是刻意練習。有目的的練習具有幾個特徵，使得它與我們所說的“天真的練習”區分開來。所謂“天真的練習”，基本上只是反覆地做某件事情，並指望只靠那種反覆，就能提高表現和水平。史蒂夫·奧爾（Steve Oare）是威奇托大學從事音樂教育的專家，他曾提供過一段假想的對話，假設對話在一位音樂導師和年輕學生之間進行。這種關於練習的對話，音樂導師經常會跟學生講。在這個例子中，導師試圖搞懂為什麼年輕的學生一直沒有進步。導師：從你的練習清單可以看出，你每天練習1小時，但你每次測試的時候，總是隻有C的成績。能不能解釋一下原因？學生：我不知道發生了什麼！我昨天晚上都演奏了！導師：你演奏了多少次？學生：10次或者20次。導師：你彈對了多少次？學生：唔，我不知……一次或兩次吧……導師：哦……你是怎麼練習的？學生：我不知道。我只是埋頭彈！簡單地講，這就是天真的練習：只是埋頭幹！我剛剛揮起球拍，努力去擊球。我剛剛聽到了那些數字，想辦法去記住。我剛剛看到了那些數學題，正試著解答。有目的的練習"
        },
        {
          "title": "有目的的練習的四個特點",
          "content": "有目的的練習具有定義明確的特定目標我們假想的音樂學生如果確定了類似下面這樣的練習目標，可能會比他漫無目的的練習要成功得多：“連續三次，不犯任何錯誤，以適當的速度彈奏完曲子。”如果不制訂這樣一個目標，就沒有辦法判斷練習是不是成功了。在史蒂夫·法隆的案例中，我們並沒有制訂長遠目標，因為我們都不知道他可能記得住多少個數字，但他有一個極具針對性的短期目標：每次都比上一次多記住一個數字。他好比一位極具競爭力的長跑選手，而且，他把長跑的態度帶到了實驗之中，即使他只是在和自己競爭。從一開始，史蒂夫就逼著自己每天都增加一個數字，使自己能夠記住。有目的的練習，主要是“積小勝為大勝”“積跬步以至千里”，最終達到長期目標。如果你平常週末都去打一打高爾夫球，而你想將你的差點[1]降低至5杆，那麼，這對總體目標十分有益，但還不是一個定義明確的具體目標。定義明確的具體目標，可以有效地用於引導你的練習。要把目標分解，並制訂一個計劃：為了將差點降至5杆，你得做些什麼？其中的一個目標可能是增加把球打入平坦球道的次數。這是一個合理的具體目標，但你甚至還得將它進一步分解：為了成功地把球打入平坦球道，你到底要做些什麼？你得搞懂，為什麼你有那麼多次沒能把球打到平坦的球道上去，並且解決這個問題，比如說，想辦法糾正你總是勾球的毛病。怎麼做到？可以請一位教練來教你怎樣以特定方式改一改你的揮拍動作。諸如此類。關鍵是接受那個一般目標（並且日漸精進），並將其轉化成一些具體目標，使你能達到切合實際的進步的期望。有目的的練習是專注的史蒂夫·法隆不同於奧爾描述的那位音樂學生，而是一開始就非常專注於他的任務，隨著實驗的一步步進行，記住越來越長的數字串，他的注意力也更集中。你可以聽一聽他在第115次訓練時的錄音帶，就可以對他的專注有所感受。第115次練習恰逢我們的實驗進行到一半。當時，史蒂夫一般能夠記住接近40個數字的數字串了，但還不能穩定地記住40個數字，而他真的很想在這一天做到。我們首先從35個數字開始，那對他來說已經很容易了，於是，他開始迫使自己增加數字串的長度。在我讀出39個數字的數字串時，他對自己說了一句鼓舞士氣的話，聽起來跟他正接近完成的任務沒有什麼關係。他說：“我們今天在這裡完成突破！……我不會錯過這次突破的機會，不是嗎？當然不會……這將是轉折的時候！”我花了40秒讀出那些數字，他一直保持沉默，但那時，隨著他仔細在腦海中回顧那些數字，記住它們不同的分組以及出現的不同順序，他幾乎控制不住自己了。好幾次，他大聲地拍著桌子，還經常拍手，顯然是在慶祝他記得這一組或那一組數字，或者記得它們在數字串中處在什麼位置。他一度大聲喊出來：“絕對正確！我很確定！”當他說出最後一個數字時，回頭看我。我告訴他說，他真的背出來了。於是，我們接下來開始背40個數字。這一次，他又開始自言自語：“這次，大任務來了！如果我過了這一關，就全都結束了！我必須過了這個關卡。”在我讀數字的時候，他再度保持沉默，接著，輪到他背誦時，他又發出興奮的嘈雜聲，並且在他想出來之後，大聲地歡呼：“哇……來吧！……好的！……繼續！”他又一次背出來了，事實上，這一次的練習已經成為他能夠經常背出40個數字的練習了，儘管他再背不了更多。如今，並非每個人都通過高聲叫喊和拍桌子的方式集中注意力，但史蒂夫的表現說明了我們可以從有效練習的研究中獲得一條重要洞見：要想取得進步，必須完全把注意力集中在你的任務上。有目的的練習包含反饋你必須知道某件事情自己做得對不對，如果不對，你到底怎麼錯了。在奧爾的例子中，音樂學生在學校的表演測試上得了個C，這是一種遲到的反饋，但他在練習時，似乎沒有人給他提供任何反饋，也就是說，沒有人聽他練習並指出他的錯誤，而這位學生看起來根本不知道他的練習是不是出了錯。（“你有多少次正確地彈奏了曲子？”“唔，我不知道……一次或兩次吧……”）在我們的記憶研究中，每次嘗試之後，史蒂夫便會得到簡單而直接的反饋，如對還是錯，成功還是失敗。他總是知道自己的位置。但最為重要的反饋，也許是他自己給自己提出的。他密切關注那些他記不住的數字串。如果把這樣的數字串背錯了，他通常知道到底是什麼原因，以及他漏背了哪些數字。即使最後他終於背出來了，他事後也會告訴我，哪些數字讓他感到難以記住，以及哪些數字完全沒問題。他意識到了自己的弱點在哪裡，便可以適當地轉變他的關注焦點，並提出新的記憶方法來彌補那些弱點。一般而言，不論你在努力做什麼事情，都需要反饋來準確辨別你在哪些方面還有不足，以及怎麼會存在這些不足。如果沒有反饋（要麼是你自己給自己提出的，要麼是局外人給你提出的），你不可能搞清楚你在哪些方面還需提高，或者你現在離實現你的目標有多遠。有目的的練習需要走出舒適區這也許是有目的的練習最為重要的一個組成部分。奧爾的音樂學生並沒有逼迫自己走出熟悉和舒適的區間。相反，學生的話似乎表明，他在練習中，只是毫無條理地進行了一些嘗試，並沒有努力去迎接新的挑戰，僅僅是做那些他已經感到很容易的事情。而這種方法是不管用的。我們的記憶實驗在設計之初就避免讓史蒂夫感到太舒服。隨著他增強自己的記憶能力，我會用更長的數字串來挑戰他，以便他總是能在離自己的能力極限不遠的地方發揮出自身的能力。特別是，每次他背出來了，我便增加數字的數目；他沒背出來，我便減少數字的數目。這樣一來，我把數字的數目恰好保持在他能夠背得下來的程度，同時也總在促使他記住只比之前多一個數字的數字串。對於任何型別的練習，這是一條基本的真理：如果你從來不迫使自己走出舒適區，便永遠無法進步。比如，業餘鋼琴愛好者在十幾歲的時候就開始上鋼琴課，等到30年過去了，他還在以完全相同的方式彈奏著那些同樣的歌曲，看起來，在那段時間裡，他已經積累了數十萬個小時的“練習”，但他絕不會比30年前彈得更好。事實上，可能還比年輕時彈得更差。同樣，這種現象放在醫學上，也是這個道理，而且，我們有特別有說服力的證據。研究界對許多專家進行過研究，結果發現，已訓練三四十年之久的醫生，在一些客觀績效指標的測量上，比那些剛從醫學院畢業兩三年的醫生更差一些。這表明，那些醫生中的大多數在他們的日常練習中並沒有精進自己的業務，或者也沒能保住他們的能力；他們沒有給自己設定太大的挑戰，或者沒有將自己推出舒適區。出於這一原因，我在2015年參加一個共識大會時，辨別了一些醫學繼續教育的新型別，這些教育將給醫生出難題，並幫助他們保持和精進他們的技能。我們將在第5章詳細探討這一話題。關於這一點，我最喜歡的例子也許是本傑明·富蘭克林的國際象棋棋藝。富蘭克林是美國第一位著名的天才。他是一位科學家，因其對電的研究而名聲遠揚；又是一位受歡迎的作家和出版家，出版了《窮理查智慧書》（Poor Richard抯Almanack）；還是美國第一家公共借閱圖書館的創始人、卓有成就的外交家、發明家等，我們還知道跟他有關的事物是雙焦眼鏡、避雷針和富蘭克林火爐。但他最痴迷的是國際象棋。他是美國第一位國際象棋棋手，曾參加過最早的國際象棋比賽，並在那裡廣為人知。他下了30年國際象棋，老了的時候，他把更多的時間花在下棋上。他在歐洲的時候，和當時最著名的棋手下過棋。儘管他曾給大家提過“早睡早起”的建議，但他自己下起國際象棋來，往往下到早上6點，直到太陽升起。因此，本傑明·富蘭克林那麼聰明，而且又花了數千個小時來下棋，有時候還和當時最佳的棋手過過招。他是不是讓自己成了最偉大的國際象棋棋手？沒有。他的水平只能說是中上等，從來沒有強大到能與歐洲優秀棋手相提並論的地步，更別說最優秀了。在國際象棋上的失敗，令他感到異常氣餒，但他從不知道，為什麼自己的棋藝無法精進了。如今我們都明白了其中的原因，那便是：他從來沒有逼一逼自己，從來沒有走出過舒適區，也從來沒有進行數小時的刻意練習，而那種練習正是提高棋藝所需要的。他就如同一名在30年的時間裡一直以同樣的方式彈同樣一些曲子的鋼琴家。這種做法，是使自己停滯不前的“訣竅”，而不是使自己技藝精進的祕訣。[1] 指高爾夫運動中給弱者增加的杆數。——譯者注"
        },
        {
          "title": "遇到瓶頸怎麼辦",
          "content": "走出舒適區，意味著要試著做一些你以前沒做過的事情。有時候，你也許發現，做一些沒做過的事情，相對較為容易，然後你會繼續逼迫自己。但有時候，你偶然碰到了那些讓你感到很難做好的事情，似乎你永遠也做不了。想辦法去逾越這些障礙，是通向有目的的練習的隱藏鑰匙。試著做不同的事情，而非更難的事情通常情況下，這種解決方案並不是“試著做更難的事情”，而是“試著做不同的事情”。換句話講，這是一個方法問題。在史蒂夫的案例中，當他背誦到22個數字時，碰到了一個障礙。結果，他把它們分為四個組，每組四個數字，運用各種不同的記憶竅門來記住這些數字組，然後再加上一個包含6個數字的排練組，放在最後，以便他可以一遍又一遍地重複，直至能借助數字的聲音來記住這個組。但他沒能搞懂怎樣記住這22個數字，因為當他在腦海中把它們按一共五個組、每組四個數字來排列的時候，他對數字的順序有些混淆。最後，他突然想到一個主意：同時使用三個數字一組和四個數字一組的兩種組合，這樣一來，他終於取得了突破，使自己運用了四個數字組、每組四個數字，以及四個數字組、每組三個數字、再加個六個數字的排練組，最多記到了34個數字。然後，一旦他達到那一極限，就必須再想其他辦法了。這就是史蒂夫在我們的整個記憶研究中一種常規的模式：首先取得進步，然後到了一個瓶頸，被困住了，尋找不同的方法來克服障礙，最後找到了這種方法，然後又穩定地提高，直到下一個障礙出現。不管什麼障礙，越過它的最好辦法是從不同方向去想辦法，這也是這種方法需要導師或教練的一個原因。有些人已經熟悉了你可能遇到的障礙，於是，可以為你提供克服障礙的方法。事實證明，有時候，其實更多的是心理層面的障礙。著名小提琴導師多蘿茜·迪蕾（Dorothy DeLay）曾描述過，有一次，她的一位學生前來找她，請她幫他加快在某首曲子上的演奏速度。原來，根據時間安排，他要在一個音樂節上演奏該曲。學生對多蘿茜說，他演奏得不夠快。多蘿茜問他，到底演奏得多快？他回答說，他想和世界著名小提琴家伊扎克·帕爾曼（Itzhak Perlman）一樣快。於是，迪蕾首先錄下了帕爾曼演奏的那首曲子，並記下了時間。然後，她設定了一個節拍器，以減慢速度，讓她的學生根據減慢的速度來演奏，這當然在學生的能力範圍之內。她讓他一遍遍地演奏，每次都稍稍加快一點節奏。於是，學生每次都能演奏好。到最後，等到學生可以分毫不差地演奏這首曲子後，多蘿茜告訴學生：他實際已經演奏得比伊扎克·帕爾曼更快了。比爾·蔡斯和我兩人對史蒂夫採用了好幾次相似的方法，當時，史蒂夫遇到了一個障礙，認為他可能無法進一步提高自己的記憶力了。我一度稍稍放慢了讀數字的速度，使得史蒂夫有更多時間來記住明顯多得多的數字。這讓他確信，問題並不在於那些需要他記住的數字有多少，而在於他能多麼迅速地將數字編碼到記憶中去，也就是為構成整個數字串的各組不同的數字找到記憶術，如果他可以加快速度將數字放到長時記憶中去，那麼，他就有可能提高自己的表現。另一次，我給史蒂夫的數字串，比起他在那個時刻能夠記住的數字串長了10個數字。結果，他記住了那些數字串中更多的數字，連他自己也感到吃驚。特別是，儘管記得並不太完美，但他記住的數字總數，已經打破了此前的記錄。這讓他確信，事實上他完全有可能記住數字更多的數字串。他意識到，他的問題並不是自己已經抵達了記憶力的極限，而是他在整個數字串中漏掉了一組或兩組數字。他認定，繼續前進的關鍵是更加仔細地將數字的小組進行編碼，於是，他又開始提高自己的水平了。並非達到極限，而是動機不足不論什麼時候，只要你在努力提高自己在某件事上的水平，都會偶然碰到那些障礙，也就是說，在某些時刻，似乎你不可能再取得任何進步了，或者，至少你根本不知道自己該做些什麼才能提高水平。這是自然而然的。不自然的是那種真正讓你完全停下腳步的障礙，那種不可能逾越的障礙。在我多年的研究中，並沒有找到任何清晰的證據來證明，在任何行業或領域，人們真的會遇到績效和表現完全不變的極限。相反，我發現，人們通常會在努力提高自己的時候放棄並停下。這裡有一條注意事項：儘管我們總能繼續前進和不斷進步，但要想做到，並不見得總是輕而易舉。保持專注並繼續努力，是很難做到的，而且通常沒有趣味。因此，動機的問題不可避免地浮現出來：為什麼有些人願意進行這種練習呢？是什麼使他們繼續下去呢？我們將在本書中一次又一次地回顧這個至關重要的問題。在史蒂夫的案例中，有幾個因素在發揮作用。首先，他是有報酬的。不過，他本來可以總是參加我們的練習，卻在記住數字時不做格外的努力，依然能拿到他的報酬，因此，儘管獲取我們支付的報酬，是他的一部分動機，卻一定不是全部的動機。那麼，為什麼他要如此狠逼自己進步呢？我和他交談過，我認為，他的動機更大程度上因為在開始了前幾次練習之後，他開始看到自己的進步，而他確實樂於見到自己的記憶力得到強化。這種感覺很好，他希望一直有那種感覺。此外，在他的記憶能力達到了一定水平之後，他某種程度上成了名人；關於他的故事開始出現在報紙和雜誌上，他還在許多電視節目中亮相，包括《今日秀》（Today）節目。這為史蒂夫提供了另一種正面反饋。一般來講，有意義的正面反饋是保持動機的關鍵要素之一。這種反饋可能是內部反饋，比如滿足於看到你自己在某件事上的水平提高，也可能是由其他人提出的外部反饋，但它們對某個人是否能夠在有目的的練習過程中堅持不懈地努力以提高自己的水平十分重要。另一個因素是：史蒂夫樂於挑戰自己。從他以前參加過越野賽跑，而且是田徑賽場上的活躍參與者，便可明顯看出。所有認識他的人都會告訴你，他只要一參加訓練，就會和別人一樣刻苦，但他的這種動機，只是為了提高自己的表現，並不一定是為了贏得比賽。此外，他從自己多年的奔跑經歷中瞭解到，定期的訓練，一週接一週、一月接一月的訓練意味著可以有效地提高表現，而且，對他來說，每週三次、每次只進行一小時訓練，也不是一件格外艱難的任務，因為他經常參加長達三小時的跑步。後來，在結束了與史蒂夫和其他一些學生的記憶研究之後，我只招聘一類研究物件：運動員、舞蹈家、音樂家或歌手等曾接受過大量培訓的人。他們中沒有人中途退出實驗。因此，我們在這裡簡單地總結有目的的練習：走出你的舒適區，但要以專注的方式制訂明確的目標，為達到那些目標制訂一個計劃，並且想出監測你的進步的方法。哦，還要想辦法保持你的動機。對想要提高自己的每個人來講，這些是讓你有一個卓越開端的祕訣——但依然只是開始。"
        },
        {
          "title": "有目的的練習還不夠",
          "content": "儘管比爾·蔡斯和我依然與史蒂夫·法隆一起進行著我們為期兩年的記憶研究，但在史蒂夫決定用他那得到了強化的記憶去從事別的事業時，我們決定尋找另一位樂於接受相同挑戰的研究物件。我們不相信史蒂夫天生就是具備能夠記住數字的天賦，而是假定他提升的這些技能，完全歸功於他經歷過的這些培訓，而最佳的證明方法是與其他的研究物件一起，再進行同樣的研究，看一看我們是否能獲得同樣的結果。第一個自願參與研究的是一位研究生，名叫雷妮·艾里奧（Renée Elio）。在開始前，我們告訴她，她之前的那位研究物件能夠記住的數字的數量大幅度增加了，因此，她知道，那樣的進步是可能的。這樣一來，她比史蒂夫剛開始參與實驗時，知道的東西更多一些。不過，我們沒有向雷妮透露半點史蒂夫的表現。她必須想出自己的辦法來記憶。她開始練習時，進步的速度與史蒂夫非常接近，在進行了50個小時左右的練習後，她也強化了自己的記憶，能夠記得住接近20個數字。不過，和史蒂夫不同的是，到這個時候，雷妮好比碰到了一堵無法逾越的牆。後來，她又花了50個小時左右的時間，沒有取得任何進展，因此決定退出培訓。她將自己記數字的記憶能力強化到了遠比任何未經訓練的人強大的地步，並且能夠與某些記憶術專家媲美，但她感覺與史蒂夫取得的進步相比，還有很大的差距。差距在哪裡差距在哪裡？史蒂夫成功地構建了一系列的心理結構，使自己能夠使用長時記憶來回避短時記憶通常的侷限，並且記住長串的數字。那種心理結構，也就是各種各樣的記憶術（許多的這些記憶術，以執行的時間為基礎，再加上一個用於追蹤記憶術次序的體系）。例如，當史蒂夫聽到數字907時，他將它們想象成很好記的概念，9：07，或者說9分7秒，這些便不再是必須用短時記憶來記住的隨機數字了，而是他已經熟悉的概念。正如我們將會看到的那樣，改進幾乎各種型別的心理表現，至關重要的是心理結構的構建，這樣便可以避免短時記憶的侷限，並且馬上就能高效地處理大量資訊。史蒂夫做到了這一點。而雷妮並不知道史蒂夫是怎麼做到這樣的，於是採用了完全不同的方法來記數字。史蒂夫主要基於執行的時間，將數字分成三個和四個一組。他記住了那些組的時候，雷妮卻採用一系列深思熟慮的記憶術，它們得依靠天數、日期和一天中的時間，等等。史蒂夫和雷妮之間的重要差別在於，史蒂夫總是在記住數字之前，事先決定採用什麼模式來記憶，將數字串分解成三個或四個數字的數字集，到最後再加上一個由4~6個數字組成的數字串，然後，他把最後那個數字串一遍一遍對自己重複，直到他能在記憶中記住它的聲音了。例如，對於27個數字的數字串，他會把數字整理到三個組中，每組四個數字，然後再整理到三個組中，每組三個數字，最後留一個由六個數字組成的組。我們把這種預先固定的模式稱為“檢索結構”（retrieval structure），它使得史蒂夫可以著重記住三個數字和四個數字的數字組，一組一組地記，然後在腦海中記住這些單個的組適合放在檢索結構中的哪個位置。事實證明，這是一種強大的方法，因為它使得史蒂夫能將每組數字（由三個數字或四個數字組成）作為執行時間或其他記憶術加以編碼，放入其長時記憶中，然後，他不必再去想它們了，而是直到他最後回憶數字串中所有數字時才再度回顧。相反，雷妮設計的記憶術是：根據她聽到的數字是什麼，再決定使用什麼方法來記住它們。例如，對於4778245這一串數字，她可能把它記成是1978年4月7日2點45分，但如果數字串變成了4778295，她必須採用1978年4月7日的方法，然後加上一個新的日期：2月9日……由於這種方法不具備史蒂夫採用方法的那種一致性，因此，她沒法記住超過20位數字。建立檢索結構比爾和我有了那次經驗後，決定再找一位研究物件，要求他儘可能採用與史蒂夫相似的方法來記住數字串。因此，我們招聘了另一位跑步者，名叫達里奧·多納泰利（Dario Donatelli）。達里奧是卡內基梅隆大學長跑隊的一名成員，也是史蒂夫的訓練夥伴。史蒂夫告訴達里奧，比爾和我正在尋找一位研究物件，要求該物件能夠長期參與記憶訓練的研究，達里奧同意了。這一次，我們沒有讓達里奧自己去思考怎樣記這些數字，而是讓史蒂夫把他的方法教給達里奧。有了這個開始，達里奧的進步速度比史蒂夫快得多，至少是剛開始時快得多。他經歷的訓練次數明顯比史蒂夫少得多，便能記住20個數字了，但從那以後，他的速度開始放緩，一度達到了能記住30個數字的水平，但似乎史蒂夫的方法對他沒有太大的好處了，而且，他的進步開始消失。這時，達里奧開始琢磨著改編史蒂夫的方法。他提出稍稍不同的方法來編碼三個和四個數字的數字組，更為重要的是，他設計了一個明顯不同且非常適合他的檢索結構。儘管如此，當我們測試達里奧怎樣記那些數字時，發現他在依靠一些心理過程，它們與史蒂夫開發的心理過程十分相似，運用長時記憶來避開短時記憶的侷限。經過幾年的訓練，達里奧最終能記住100多個數字組織的數字串，或者說，大約比史蒂夫多記了20個數字。此刻，和之前的史蒂夫一樣，達里奧變成了這個世界上這種特殊技能最優秀的擁有者，一下子聲名遠揚。這裡有一條重要的經驗：儘管我們通過專注的訓練和走出舒適區，一般能在某種程度上提高自己做某件事的能力，但那並不是全部。刻苦努力還不夠。逼迫自己超越極限，也不夠。人們通常忽略了訓練與練習中的其他一些同等重要的方面。學術界對一種特定的練習與訓練方法進行了研究，該方法已被證明是提高人們在各個行業或領域中的能力的最強大和最有效的方式。這種方法就是“刻意練習”，我們會馬上進行詳盡描述。但首先讓我們更加密切地觀察，在這種令人稱奇的改進背後，到底有著怎樣的原因。"
        }
      ]
    },
    {
      "chapter": "第2章",
      "title": "大腦的適應能力",
      "sections": [{
        "title": "大腦的適應能力",
        "content": "如果你是一名健身愛好者，或者只是想增加一些體重，使自己的肌肉增多一些，那麼，你挑戰自己的肱二頭肌、肱三頭肌、股四頭肌、胸大肌、三角肌、背闊肌、斜方肌、腹肌、臀大肌、小腿肌肉以及膕繩肌，等等，就很容易追蹤觀察你的健身效果。你可以採用錄影的測量方法，或者簡單地每天照一照鏡子，感受一下你的進步。如果你採用跑步、騎車或游泳等方法來增強耐力，那可以通過測量心率、呼吸的方式來觀察你的進展，也可以看自己能夠持續地跑、騎、遊多長距離，直到肌肉由於乳酸的累積而顫抖為止。但如果你要挑戰自己的心理能力，比如說，想要精通微積分、學會演奏一件樂器或懂一門外語，那就不同了。要觀察你的大腦因這些挑戰而發生的改變並不容易，因為它會逐步地適應你強加給它的日益提高的要求。艱苦地訓練一天後，你的大腦皮層並不會痠痛。你的腦袋也不會真的變大，不必由於以前的帽子現在戴不下了，而出去重新買頂新帽子。你不用在額頭上訓練出六塊肌肉來。由於大腦中的任何變化你無法親眼看見，所以你很容易以為，這些訓練真的不會給你帶來太大的變化。不過，這是錯誤的。越來越多的證據表明，大腦的結構與執行都會為了應對各種不同的心理訓練而改變，而且，很大程度上像你的肌肉和心血管系統響應體育鍛煉那樣。在諸如核磁共振成像（magnetic resonance imaging，MRI）等腦部成像技術的方法幫助下，神經學家開始研究擁有特定技能的人們的大腦與不具備那些技能的人們的大腦，到底有什麼區別，同時，他們開始探索各種練習可以產生哪些型別的改變。儘管在這個領域中，要學習的知識依然很多，但我們已經足夠清楚地知道，有目的的練習和刻意練習，怎樣既增強我們的身體能力，又強化我們的心理能力，並使我們能夠做一些此前從沒做過的事情。關於我們的身體怎樣適應訓練，我們瞭解到的絕大多數知識來自對跑步運動員、舉重運動員和其他各類運動員的研究。不過，有趣的是，迄今為止，科學界圍繞“大腦為響應大量訓練會怎樣改變”而開展的一些質量最高的研究，並沒有聘請音樂家、棋手或數學家作為研究物件（這些更傳統的研究物件，一般用來研究訓練對錶現和水平所產生的影響），而是請計程車司機參與其中。"
        },
        {
          "title": "倫敦計程車司機的大腦",
          "content": "世界上幾乎沒有哪座城市可以像倫敦那樣使GPS系統陷入混亂。首先，這座城市並沒有由大道構成的道路網路來指示方位和路徑，好比紐約曼哈頓、巴黎或東京那樣。相反，城市的主幹道相互之間都形成奇怪的夾角。主幹道則呈曲線狀地彎曲著。城市中到處都是單行道，環形交叉路和“斷頭路”也隨處可見，而且，泰晤士河在城市中央穿過，因此，倫敦的市中心被十幾座橋樑跨過，使得人們在這座城市中不論進行多長時間的旅行，可能都得至少跨過一座橋樑（有時候甚至更多）。此外，倫敦市採用古怪的編號系統，有時候會讓你搞不清楚，要到哪裡才能找到某個特定的地址，即使你已經找對了地址上標明的街道。所以，對遊客來說，最好的建議是別想著租一輛帶車載導航的車去環遊倫敦，而是要靠這座城市的計程車司機把你帶到想去的地方。他們無處不在，而且有著令人震驚的能力，能以最高效的方式把你從甲地載到乙地，不僅考慮了各種可行路線的長度，考慮了一天中的時間、預期的交通狀況、臨時路況以及道路關閉情況，還可能想到了與旅行有關的其他各種細節。在倫敦，大約有2.5萬名計程車司機，每天駕駛著他們像箱子似的大型黑色計程車，穿梭於城市的大街小巷。另外，你告訴計程車司機自己想去某個地方，不一定要提供傳統的街道地址。假設你打算再逛一次查令十字街上那家專賣各種時髦帽子的小店，你又無法完整回憶起來它的名字，比如Load抯或Lear或類似的名字，但你記得，帽子店的隔壁是一家出售紙杯蛋糕的麵包房，沒關係，有這些資訊就夠了。把你知道的一切都告訴計程車司機，很快你會發現，計程車就跟自動導航似的，把你載到了那家店鋪的門前。世界上最難的測試你可能想到了，鑑於普通人在倫敦很難找到正確的路徑，並不是人人都可以當好倫敦的計程車司機。事實上，在倫敦，要想當一名獲得許可的計程車司機，必須通過一系列測試，這些測試一直被人們認為是世界上最難的測試。測試由倫敦的交通部門管理，那個機構將“知識”（也就是計程車司機必須瞭解的資訊）描述為如下內容。為了獲得許可，成為一名“全倫敦”的計程車司機，你得對以查令十字街為圓心的約9.6千米的半徑範圍內的區域有全面的瞭解。你得知道：所有的街道，房產，公園和開放區域，政府機構和部門，金融和商業中心，外交機構，市中心，登記辦事處，醫院，宗教場所，體育場館和休閒中心，機場，車站，酒店，俱樂部，劇院，電影院，博物館，藝術會展中心，學校，學院和大學，警察局和總部建築，民事、刑事和驗屍官法庭，監獄，以及遊客感興趣的其他地點。事實上，計程車乘客可能到達的任何地點，都得掌握。以查令十字街為圓心的9.6千米的半徑範圍內，大約有2.5萬條街道。但是，想要成為計程車司機的人士，必須熟悉比那個數目還要多的街道與建築物。任何的地標性建築，你都可以拿來參照，但也許沒什麼用。2014年，《紐約時報》雜誌刊登了一則關於倫敦計程車司機的新聞故事。故事講道，主管測試的機構曾經讓一位參加測試的計程車司機把主考官帶到一尊“手拿乳酪”的兩隻老鼠的雕像面前；那尊雕像只有1英尺高（約為0.3米），周圍全是高聳入雲的建築物。還要指出的是，參加測試的計程車司機還得向主考官顯示，他們可以儘快從甲地到達乙地。測試包括很多“回合”，主考官給出倫敦的兩個地點，被測試物件必須先說出兩個地點的精確位置，描述出它們之間的最佳線路，然後依次說出沿途每一條街道的名字。每一回合測試結束後，都由主考官根據計程車司機答案的準確性進行打分，然後，隨著分數的累積，測試變得越來越難，因為主考官對終點的描述會越來越模糊，行駛路線也更長、更繞、更復雜。到最後，大約一半甚至更多的計程車司機在測試中被淘汰。沒被淘汰並獲得許可的那些人，早已將倫敦的地圖內化於心，某種程度上好比胸中裝著谷歌地圖，可以隨時呼叫衛星照片，具有深不可測的記憶力和處理能力。只要乘客提供模糊的地址，他們便能駕駛著裝有攝像頭的計程車，準確地把客人載到指定目的地。為了掌握那些“知識”，打算參加測試的計程車司機要花上數年時間，把倫敦的大街小巷全都熟記於心，並做好筆記，詳細記錄哪個地方是怎樣的，以及如何從這裡去往那裡。第一步是掌握指導手冊中提供給計程車司機候選者的320回合的清單。對於某個特定回合，候選者通常首先借助摩托車，實地走一遍各種可能的線路，搞清最短的路徑是什麼，然後再實地探索這些線索的起點和終點附近地區。這意味著要在那些地方約400米的範圍內閒逛，把周圍的建築物以及附近的標誌性建築拿筆記下來。反覆這樣做過320次之後，參加測試的計程車司機已經積累了倫敦市內320條最佳線路，而且探索並記下了查令十字街周邊9.6千米內的中心地帶的每一處位置。這是一個開始，但成功的候選者還得繼續挑戰自己，以確定許多其他回合的最佳路線是不是也在清單上，並記下他們此前可能漏記了的，或者也許是最近才建成的建築物和地標。事實上，即使是已經通過測試並獲得許可的倫敦計程車司機，也要繼續提升他們對倫敦街道的掌握。由此而產生的記憶力和導航技能，讓人感到震驚，因此，對於有興趣瞭解這些現象，特別是瞭解人們如何學習導航技能的心理學家來說，倫敦計程車司機有著不可抗拒的吸引力。倫敦大學學院的神經系統科學家埃莉諾·馬圭爾（Eleanor Maguire）曾對計程車司機進行了迄今為止最深入的研究，那些研究也向我們揭示了訓練如何影響大腦。大腦就像肌肉，越練越大早在2000年，馬圭爾就發表了關於計程車司機的研究成果，那是她圍繞這一主題的最早研究成果之一。她利用核磁共振成像來觀察16位計程車司機的大腦，並將他們與另外50位男性的大腦進行比較，後者年齡與計程車司機相仿，但沒有從事計程車司機的職業。她特別觀察了海馬體，也就是大腦中涉及記憶發展、形狀像海馬的部位。通過空間導航和記住空間中事物的位置，尤其能夠啟用海馬體（實際上，每個人都有兩個海馬體，它們分別位於大腦的兩側）。例如，那些在不同地方貯存食物的鳥類，必須能記住不同的位置，因此，和另一些與之有緊密親緣關係的、但不會在不同地方貯存食物的鳥類相比，前者的海馬體相對較大。更重要的是，至少在某些鳥類中，海馬體的大小十分靈活，有的大，有的小。有些鳥的海馬體因儲存食物的經驗增大了30%，人類是不是也一樣呢？馬圭爾發現，在計程車司機的大腦之中，海馬體的一個特定部位比其他實驗物件更大，這個部位是海馬體的後部。此外，當計程車司機的時間越長，海馬體的後部也就越大。幾年之後，馬圭爾又進行了一項研究，將倫敦計程車司機與公共汽車司機進行對比。公共汽車司機也在倫敦開了好幾年車，不同的是，公共汽車司機幾年來只反覆走一條線路，不必去思考從甲地到乙地的最佳線路是什麼。馬圭爾發現，計程車司機的海馬體後部，明顯比公共汽車司機海馬體的同樣部位大得多。這其中的含義很清楚：不論是什麼原因導致海馬體後部的尺寸產生如此大的差別，都與駕駛汽車本身並沒有關係，而是與職業要求的導航技能有特定的關係。不過，這一結論依然不夠嚴謹：也許研究中的計程車司機從一開始就擁有後部更大的海馬體，使得他們在倫敦尋找位置和路線更有優勢，而他們接受的這種廣泛的測試，只是一個淘汰程式，以重點關注符合條件的計程車司機。這些司機天生就能更好地學會在倫敦的大街小巷中熟練地穿梭。馬圭爾運用十分簡單卻很有說服力的方法解答了上述這些懷疑：她追蹤觀察一組正在申請許可的計程車司機的情況，從他們接受培訓開始，直到他們要麼通過了測試，成為獲許可的計程車司機，要麼中途被淘汰並繼續從事其他職業。特別是，她招募了剛剛開始接受培訓、正在申請許可的79名計程車司機（全部都是男性）作為研究物件，另外招募了31名年齡相仿的男性作為控制組。她對所有人的大腦進行了掃描，發現正在申請許可的計程車司機與控制組成員之間的海馬體後部的大小並無差別。四年後，她重新觀察了這兩組物件。這個時候，當初的79名申請許可的計程車司機中，已有41人獲得了許可，成為計程車司機，另外的38人則不再接受培訓，或者沒能通過測試。因此，此時參加對比的有三個小組：已經獲許可的計程車司機，他們對倫敦的街道已然十分熟悉，並通過了系列測試；曾接受培訓的計程車司機，他們對倫敦的街道並不十分熟悉；以及那些根本沒有接受過培訓的控制組成員。馬圭爾再度掃描了他們的大腦，並計算了每個人海馬體後部的尺寸。研究結果讓她備感震驚。不過，如果她曾經測量過健身愛好者的肱二頭肌，本不應該對這些結果感到驚奇，但她沒有這樣做過，她只是測量了大腦中不同部位的尺寸。在接受過計程車司機培訓的那兩組實驗物件中，繼續參加培訓併成為獲許可的計程車司機的那些人，海馬體後部的體積明顯大一些。相反，中途不再參加培訓或者沒能通過計程車司機系列測試的人們，或是那些和計程車培訓專案毫無關係的控制組成員，其海馬體後部的尺寸沒有變化。幾年過去了，由於熟練掌握了倫敦的地理情況，獲許可的計程車司機的海馬體後部已經變大了，這是因為它負責空間導航。2011年，馬圭爾發表了這項研究的成果，這也許是證明人類大腦為響應密集訓練而發展和改變的最引人關注的證據。此外，她的研究還有一層清晰的含義：獲許可的計程車司機的海馬體後部，潛藏著更多的神經元和其他組織，增強了他們的導航能力。你可以把倫敦計程車司機的海馬體後部想象成男性健美運動員經過高強度訓練之後的胳膊和肩膀。他們年復一年地訓練啞鈴、鞍馬、雙槓、自由體操，練就了一身的肌肉，而這些肌肉又與他們在那些不同器械上要做的各種運動完美匹配起來，實際上，這使得他們可以做各種體操動作，遠遠突破了他們剛開始訓練時的極限。計程車司機的海馬體後部也同樣“膨脹”，但其中充滿的是腦組織，而不是肌肉纖維。"
        },
        {
          "title": "大腦擁有無限的適應能力",
          "content": "21世紀頭10年之前，大多數科學家斷然否認類似馬圭爾等人對倫敦計程車司機的大腦進行研究的成果，他們覺得這不可能。科學界一般認為，一旦某個人已成年，他的大腦“佈線”就已經相當固定了。沒錯，我們每個人都明白，在你學習一些新知識時，大腦的某些部位一定會有一些調整，科學家們認為，這些調整只不過是強化了某些神經連線，弱化了另一些神經連線，因為大腦的整個結構及其各種各樣的神經網路仍然是固定的。上述這種觀點，與下面這種觀點密切相關：個人在能力上的差別，主要由大腦“佈線”的不同而導致，它是由遺傳基因決定的，而學習，只不過是發揮某人遺傳潛能的一種方式而已。一個常用的隱喻是把我們的大腦描述成電腦：學習就像載入資料或安裝新的軟體，使你可以做一些以前做不到的事情，但你的最終效果總是受到一些因素的限制，比如隨機存取儲存器（RAM）中的資料數量，以及中央處理器（CPU）的能力，等等。身體的適應能力相反，如我們已經提到的那樣，人們身體上的適應能力總是更容易辨別。關於身體的適應能力，我最喜歡用做俯臥撐的例子來證明。如果你在20多歲的時候身體相對健康，而且是男性，你也許能做40個或50個俯臥撐；如果你能做100個，你的朋友可能對你刮目相看，而且，如果他們和你打了賭，那他們毫無疑問會輸。那麼，根據上面的這些資訊，你認為俯臥撐的世界紀錄會是多少個？500個還是1000個？1980年，一位日本人創下了連續做10507個俯臥撐的紀錄。在此之後，吉尼斯世界紀錄不再接受人們提交的紀錄申請，轉而接受在24小時之內做完的最多次數俯臥撐的紀錄。1993年，一位美國人在21小時21分鐘之內做完了46001個俯臥撐，這一紀錄當前仍然沒有被打破。或者，想一想引體向上的例子。即使是相對健康的男性朋友，通常也只能做10個或15個，儘管如此，如果你真的訓練過，也許可以做40個或50個。但在2014年，一位捷克人在12小時之內做了4654個引體向上。簡單地講，人類身體的適應能力令人難以置信。這種適應能力，不僅僅是骨骼肌肉的，還是心臟、雙肺、迴圈系統、身體的能量儲存以及更多其他方面的，凡是與身體爆發力和耐力相關的各個方面，都包括在內。儘管適應能力依然存在極限，但並沒有跡象表明我們已達到那些極限。從馬圭爾以及其他學者的研究成果中，我們瞭解到，大腦的適應能力也與我們身體的適應能力非常相似，不但程度相近，而且類別相差無幾。盲人大腦如何“重新佈線”對這種適應能力（或者像神經系統科學家所說的“可塑性”）最早的觀察結果，在一些研究中多次出現，這些研究著眼於盲人或聾啞人的大腦怎樣“重新佈線”，以便為大腦中專門用於處理視覺或聽覺的部分找到新的用途，這些部分對於失明或失聰的人來說已經用不上了。絕大多數失明者由於眼睛或視覺神經出了問題，無法看見東西，但視覺皮層和大腦中其他的部位依然在充分運轉；他們只是無法從眼睛那裡獲得任何資訊。如果說大腦真的像電腦那樣是硬連線的，那麼，這些視覺區域永遠在那裡空閒著。不過，我們現在知道，大腦會重新分配它的神經元的路徑，以便這些以其他方式無法得到運用的區域也可以用來做其他的事情，特別是涉及其他感覺（如觸覺、味覺、嗅覺等）的事情。失明者必須依靠其他那些感覺，從周邊的環境中獲得資訊。例如，為了能夠閱讀，失明者要用他們的指尖來觸控布萊葉點字法（盲文的一種）上突起的小點點。研究人員使用磁共振成像機器來觀察失明的研究物件在閱讀盲文時大腦的活動，看到大腦中發亮的部分，就是視覺皮層。對於視力正常的人們，視覺皮層可能在處理來自雙眼（而不是指尖）的資訊時才會發亮；但對於失明者，視覺皮層幫助他們解讀在指尖觸控到盲文上突起的小點點時的感覺。有趣的是，重新佈線並不只是發生在沒有以其他方式得到運用的大腦部位上。如果你足夠多地練習做某件事情，你的大腦會改變某些神經元的用途，以幫助完成那件任務，即使它們已經有了其他事情要做。在這方面，最引人關注的證據也許來自20世紀90年代科學家所做的一個實驗。研究人員觀察了一組十分熟練的盲文閱讀者在閱讀時，控制他們手上各個不同手指的大腦部位的情況。參與研究的是用三個指頭來閱讀盲文的失明者，也就是說，他們用食指來閱讀構成單個字母的點的圖案，用中指來判斷字母之間的空間，用無名指來追蹤他們閱讀時特定的行數。大腦中負責控制手指的部位通常開始佈線，以便每個手指頭的動作都有一個截然不同的部位負責。例如，正是因為這樣，我們才有可能清晰地判斷哪個指頭的指尖碰到了物體，以及碰到的物體究竟是鉛筆筆尖還是一顆圖釘，而根本不需要低頭去看我們的手指。研究中的參與物件是一些盲文老師，他們每天都要用手指頭去觸控盲文，一摸就是幾個小時。研究人員發現，他們經常使用三個手指頭，已經使大腦中專門用來負責這三個指頭的部位增大了許多，以至於那些部位到最後都重疊起來了。結果，參與研究的物件對這三個指頭上的觸覺格外敏感，和視力正常的研究物件相比，他們能夠察覺到輕柔得多的觸碰，但通常無法分辨到底是觸碰了三個指頭中的哪一個。這些對失明研究物件的大腦可塑性的研究，類似於對失聰研究物件的大腦可塑性的研究，其結果告訴我們，大腦的結構和功能並不是固定不變的。它們會根據你對它們的運用而改變。因此，通過清醒的、刻意的練習，以我們期望的方式來塑造大腦，包括你的大腦、我的大腦以及任何人的大腦，都是可能的。研究人員剛剛開始探索可以將這種可塑性付諸運用的各種不同方式。迄今為止最引人關注的結果，可能對一些特定人群有特別的含義，即那些隨著年齡增大而飽受遠視痛苦影響的人們。幾乎每個50歲以上的人，對那種遠視都有切身體會。這項研究是由美國和以色列的神經系統科學家及視力研究人員進行的，其結果於2012年釋出。科學家組織了一組中年志願者作為研究物件，他們所有人都難以對附近的物體聚焦。這種情況，官方的名稱是老花眼，是由於眼睛本身的問題而造成的，因為眼睛的晶狀體失去了伸縮性，使得人們更難充分地聚焦，以觀察微小的細節。此外，老花眼還存在一種難以覺察亮與暗之間的對比度的情況，這加劇了聚焦的難度。這些結果，對於驗光師和眼鏡商來說是一種好處，卻時刻困擾著50歲以上的人群，他們中幾乎所有人都需要佩戴老花鏡才能閱讀或者從事需要細緻觀察的工作。研究人員讓研究物件每週來實驗室3次左右，連續3個月保持這樣的頻率，並且每次花30分鐘來訓練他們的視力。研究人員要求他們觀察一張小小的圖片，將圖片放置在與其形狀非常相似的背景之中；也就是說，圖片與背景之間的對比度很小。要觀察圖片，需要高度集中注意力，還得付出巨大的精力。隨著時間的推移，研究物件學會了迅速而準確地辨別圖片。到3個月的訓練結束時，研究人員組織了測試，以瞭解研究物件能夠觀察多大尺寸的圖片。總體而言，研究物件能夠閱讀比他們在剛開始訓練時小了60%的文字，而且，每位研究物件都改進了視力。此外，在訓練之後，研究物件能夠不戴眼鏡讀報了，這是他們中大多數人在接受訓練之前無法做到的。不但如此，他們讀報的速度也比從前更快了。令人驚奇的是，所有這些改進，並非由眼睛本身的變化造成。研究物件的眼睛還和從前一樣，晶狀體依然缺乏伸縮性，而且難以聚焦。相反，這些改進是由他們大腦中某些部位的改變引起的，這些部位負責解讀來自眼睛的視覺訊號。儘管研究人員並沒有準確地指出這些改變到底是什麼，但他們認為，研究物件的大腦學會了對圖片“去模糊”。人們看圖片模糊，是由兩種不同的視覺缺陷共同引起的，一是無法看清微小的細節，二是難以察覺對比度中的差別。這兩個問題，都可以藉助在大腦中執行的圖片處理來緩解，其方式很大程度上與電腦中的圖片處理軟體一樣，或者像照相機那樣，可以通過操縱對比度等來修飾圖片。開展這項研究的研究人員認為，他們的訓練教會了研究物件的大腦對視覺訊號進行更好的處理，這反過來使研究物件能辨別更加細微的細節，不需要改善來自眼睛本身的訊號。"
        },
        {
          "title": "走出舒適區的重要性",
          "content": "為什麼人類的身體與大腦一開始就具有如此強大的適應能力呢？諷刺的是，它全都源於這樣一個事實：單個的細胞和組織在盡最大的努力使一切保持相同。身體偏愛穩定性人類的身體有一種偏愛穩定性的傾向。它保持穩定的內部溫度，保持穩定的血壓和心率，並使得血糖穩定、PH值（即酸鹼度水平）平衡。它使我們的體重日復一日地保持合理的一致。當然，所有這些全都不是完全靜態的。例如，如果進行鍛鍊，人們的心率會加快；如果暴飲暴食，人們的體重會增加；如果節食，人們的體重會下降。但是，這些變化通常是暫時的，而身體最終會回到它原來的模樣。對於這種現象，技術上的術語是“體內平衡”（homeostasis），它只是意味著一個系統（可以是各種型別的系統，但最常見的是一種活著的生物，或者是活著的生物的某些部位）以一種保持其自身穩定性的方式來行動的趨勢。單個的細胞也喜歡穩定性。它們保留一定的水分，並且通過控制著哪些離子和分子留在細胞膜之內，哪些則排出細胞膜之外的方式，調節正離子和負離子（特別是鈉離子和鉀離子）以及各種各樣小分子的平衡。對我們來說更為重要的是，如果要讓細胞有效地運轉，就需要一個穩定的環境。假如周圍的組織過熱或者過冷；假如它們的流動水平過快，超出了理想的範圍；假如氧氣含量下降過快；或者假如能量供應過於緩慢，都會破壞細胞功能的發揮。如果這些變化幅度太大且持續時間過長，細胞就開始死去。因此，身體需要各種各樣反饋機制的支援，這些反饋機制著力維持現狀。想一想，當你進行某種強有力的體育活動時，會發生什麼。肌肉纖維的收縮使單個的肌肉細胞擴大它的能量與氧氣的供應，這些能量與氧氣需要由附近的血管來補充。但現在，隨著血流中的氧含量和能量供應量下降，身體需要採取各種措施來響應。心跳開始加快，以增加血液中的氧含量，並排放更多二氧化碳。身體儲存的各種不同能量都轉換成肌肉可以使用的那種能量，並注入血流之中。與此同時，血液迴圈也加快，以便更好地將氧氣和能量傳送到需要它們的身體部位上去。只要體育鍛煉並非費力到讓身體的體內平衡機制無法正常執行，那麼，它基本上不會引起身體上的生理變化。從身體的角度來看，它沒有理由改變；一切還是照常運轉。但當你從事持續而有力的體育鍛煉，使得身體超出了體內平衡機制能夠補償的界限時，就是另一回事了。被迫走出舒適區之後超出界限後，你的身體系統和細胞自身會處在異常狀態下，含氧量和各種與能量相關的化合物含量都異常低，比如葡萄糖、二磷酸腺苷（adenosine diphosphate，ADP）、三磷酸腺苷（adenosine triphosphate，ATP），等等。各種細胞的新陳代謝不再像往常那樣繼續下去，因此，細胞中的生物化學反應，與正常狀態下完全不同，產生的生物化學產品也和細胞通常產生的完全不同。細胞對這種狀態的改變不滿意，它們通過升高細胞DNA中的一些不同的基因來響應。（DNA中的大多數基因，在任何特定的時間都是不活動的，而細胞會“開啟”和“關閉”各種不同的基因，這取決於它在那個時刻需要些什麼。）這些剛剛啟用的基因將開啟或者提升細胞內部各種生物化學系統，由那些系統來改變細胞的行為，使細胞順應這樣的事實：細胞和周圍的系統已經被迫走出了它們的“舒適區”。細胞內部到底是怎樣進行活動以應對這些壓力的，其細節極為複雜，研究人員還只是剛剛開始揭示它們。例如，在一項關於老鼠的研究中，從事研究的科學家計算了112種不同的基因，當老鼠後腿的某塊特定肌肉上的負荷突然增大時，這些基因便會開啟。通過已經開啟的特定基因來判斷，順應包括許多方面，比如肌肉細胞的新陳代謝發生改變、細胞的結構發生改變以及肌肉細胞形成的速度發生改變。所有這些改變，最終的結果是強化了老鼠的肌肉，以便它們能夠應對增加的負荷。老鼠還被逼著走出了舒適區，而肌肉對此的順應方式是：變得足夠強壯，以建立新的舒適區。這樣就重新建立了體內平衡。這就是體育鍛煉製造身體變化的一般模式。當身體的系統（比如某些肌肉、心血管系統或者其他系統）感受到壓力，以至於原來的體內平衡無法繼續保持下去時，身體便會開始響應那些變化，目的是重新建立體內平衡。比如，假設你開始執行一個有氧運動的計劃，如每週慢跑三次，每次跑半個小時，使你的心率保持在最大心率的70%左右的水平（對於年輕人，應當超過140次）。這種持續的活動，將使得供應腿部肌肉的毛細血管的氧含量降低。於是，你的身體將通過生長新的毛細血管的方式來應對，以便為腿部的肌肉提供更多的氧，並使你的雙腿重新回到它們的舒適區。這正是我們可以怎樣利用身體對體內平衡的渴望而推動變化的例子：足夠努力地鍛鍊，並且保持足夠長的時間，那麼，身體將以各種方式來改變，使得那種努力變得更容易。你會稍稍變得更強壯一些，積累一定的耐力，身體也變得更協調一些。但這裡也有一個陷阱：一旦補償已發生，也就是說，新的肌肉纖維已經生長出來並變得更加高效，新的毛細血管也已長出，等等。那麼，身體就能輕鬆應對以前感到十分艱難的那些體育鍛煉活動了，它會再度感到舒服。改變也停止了。因此，要使改變不斷進行下去，你必須不斷地加碼：跑得更遠一些、更快一些，並且爬坡跑。如果你不繼續給自己施加一些壓力，身體將會保持體內平衡，儘管此時的體內平衡不同於以前，但你將停下改進的腳步。挑戰越大，變化越大，但不要太過這解釋了持續將自己推出舒適區的重要性：你要使身體的補償變化不停地發生，但如果一下子推得太猛，使自己遠遠離開了舒適區，就有可能受傷，而且，事實上反而阻礙了你的提高。至少，這是身體響應體育鍛煉活動的一種方式。對於這些方面，科學家已經瞭解了許多，但他們對人類大腦如何響應心理上的挑戰，卻知之甚少。身體與大腦的一個主要差別是：成年人大腦中的細胞，一般並不會分裂並組成新的大腦細胞。當然，也有少數幾種例外，比如在海馬體中，新的神經元可以生長，但發生在絕大多數大腦部位之中的、為了順應心理挑戰而進行的改變（比如通過訓練對比度來提高人們的視力），沒有包含新的神經元的長出和發育。相反，大腦會以各種不同方式來“重新佈線”那些網路，例如，強化或弱化神經元之間的各種連線，同時還增加新的神經元連線或摒棄舊的神經元連線。髓磷脂的含量也會增加，在神經細胞周圍形成的隔離鞘，允許神經訊號更加迅速地傳遞；髓鞘形成可以使神經脈衝的速度提高10倍之多。因為這些神經元網路負責思考、記憶、控制移動、解讀感官訊號以及大腦的所有其他功能，重新調整和加快這些網路的運轉速度，使人們可以做各種各樣的事情，譬如不用戴眼鏡讀報，或者迅速確定從甲地到乙地的最佳路徑等，那些事情都是以前做不了的。一個人遇到的挑戰越大，在一定程度上，大腦中的變化也越大。一方面，最近的研究表明，人在學習一項新的技能時，如果能夠觸發大腦結構的變化，那麼，這種學習比起只是繼續練習已學會的某項技能時的學習要高效得多。另一方面，在過長的時間內過分地逼迫自己，可能導致倦怠和學習低效。大腦和身體一樣，對於處在舒適區之外卻離得並不太遠的“甜蜜點”上的挑戰，改變最為迅速。"
        },
        {
          "title": "練習改變大腦結構",
          "content": "人類大腦和身體通過發展新的潛力以響應各種挑戰的事實，其背後潛藏的原理是有目的的練習和刻意練習的有效性。倫敦計程車司機、奧運會體操選手或者音樂節上小提琴演奏家等人的訓練，事實上是一種充分利用大腦和身體的適應能力發展和提升新能力的方法，而這些能力，我們以前並沒有通過其他方式來發展和提升。音樂訓練如何改變大腦要證實上述觀點，最好是觀察音樂能力的發展與提升。過去20多年，研究人員極為細緻地研究了音樂訓練如何影響大腦，以及那些影響反過來如何造就在音樂上的極高造詣。最有名的研究發表在1995年的《科學》（Science）期刊上。阿拉巴馬大學伯明翰分校的心理學家愛德華·陶布（Edward Taub）與四位德國科學家合作，招募了六位小提琴演奏家、兩位大提琴演奏家和一位吉他演奏家，這些人全都不是左撇子。研究人員對他們的大腦進行了掃描。另外，他們還招募了六位並非音樂家的實驗物件作為控制組成員，作為那些音樂家的參照物件。陶布想了解的是，這兩群人在他們的大腦中專門用於控制手指的部位上有哪些區別。陶布最感興趣的是音樂家左手的手指。演奏小提琴、大提琴或者吉他，需要對那些手指進行超常的控制。手指得在樂器上來回滑動，而且需要在琴絃之間來回切換（有時，這種切換的速度奇快無比），還必須異常準確地把手指放在特定的位置。此外，從樂器中發出的許多抖動的聲音，比如顫音等，涉及手指放在某些位置時的滑動或顫動，通常需要大量的練習才能熟練掌握。左手的大拇指幾乎不會用到，主要只是用一些力氣，以便左手握緊樂器。右手的功能也比左手簡單得多，對大提琴和小提琴演奏家而言，主要是握住琴弓，而對吉他來說，主要是撥彈或捏住弦。簡單地講，對這類樂器演奏者的訓練，重點是加強他們對左手手指的控制。因此，陶布提出的問題是：這會對大腦產生什麼影響？陶布的團隊使用腦磁波描記器來確定研究物件的大腦控制了哪些手指，這種儀器通過檢測大腦中細微的磁場，勾畫了大腦的活動。特別是，實驗人員還觸碰了研究物件的單個手指，並觀察每次觸碰時，他的大腦的哪些部位給予了響應。實驗人員發現，與非音樂家研究物件相比，音樂家大腦中控制左手的區域明顯大得多。特別是控制手指的大腦區域，已經佔據了通常專門用於控制手掌的那些區域的一部分。此外，音樂家開始演奏的時間越早，這種膨脹就越明顯。相反，在音樂家與非音樂家的實驗物件控制右手手指的大腦區域中，研究人員並沒有發現任何差別。這些研究的含意是明顯的：音樂家年復一年地練習某種絃樂器，使他們大腦中控制左手手指的區域逐漸變化，從而使他們控制那些手指的能力也日漸增強。這次研究之後的20年裡，其他研究人員詳細闡述了其研究成果，並描述了音樂訓練影響大腦構造和執行的各種不同方式。例如，與非音樂家的研究物件相比，音樂家在控制移動中發揮著重要作用的大腦部位，也就是小腦，通常大一些，而且，音樂家訓練的時間越長，小腦也越大。與非音樂家的研究物件相比，音樂家在皮層的各種不同部位中擁有更多的腦灰質（一種包含神經元的大腦組織），包括軀體感覺區（觸覺和其他感覺）、頂上區（來自雙手的感覺）以及前運動皮層（計劃移動和引導在空間中的運動）。對於那些沒有接受過神經科學培訓的人們，一旦知道哪些大腦區域中到底會發生什麼，可能會讓他們感到震驚，但從巨集觀來看，卻是十分清楚的：音樂訓練以各種不同方式改變了大腦的結構與執行，使人們的音樂演奏能力進一步增強。換句話講，最有效的訓練形式其實不只是幫助你學會某種樂器的那些訓練，而且是更深入和更高階的訓練，這些訓練確實增強了你演奏樂器的能力。當你演奏音樂時，這些訓練改變了你大腦中的部位，從某種程度上提升了你自己的音樂“天賦”。從純智力技能到純體格技能除了音樂領域之外，科學家在其他行業或領域所做的這類研究不是太多，儘管如此，在科學家已經研究的每一個行業或領域，結果都相同：長期的訓練，使大腦中與那種特定技能相關的部位發生了改變。這些研究有的著眼於純智力的技能，比如數學能力。例如，與非數學家的研究物件相比，數學家的頂下小葉中的腦灰質明顯多得多。這個大腦區域負責數學計算和看見空間中的物體，在數學領域的許多方面，這些功能十分重要。此外，它恰好也是研究過阿爾伯特·愛因斯坦的神經系統科學家十分關注的大腦區域。那些科學家發現，愛因斯坦的頂下小葉比常人大許多，而且形狀也格外異常，這些發現使得科學家們推測，愛因斯坦的頂下小葉，可能在他進行抽象數學思考方面發揮著至關重要的作用。難道像愛因斯坦那樣的人，一生下來就擁有比常人更發達的頂下小葉，因而具有擅長數學思考的天賦嗎？你可能會這樣想，但是，研究人員對數學家與非數學家大腦部位的尺寸進行過研究，結果發現，那些從事數學研究工作時間越長的數學家，其右側的頂下小葉中腦灰質越多，這可能意味著，頂下小葉這個部位更大，是他進行大量數學思考的結果，而不是天生就如此。許多科學家對那些既有心理因素又有生理因素的技能開展了眾多研究，比如音樂演奏。最近的一項調查關注了滑翔機飛行員和非飛行員的大腦，發現飛行員的大腦在幾個不同區域中擁有更多的灰色區域，包括左腹側前運動皮層、前扣帶皮層以及輔助眼區。這些區域似乎涉及許多方面，包括學習怎樣使用滑翔機的控制桿，在飛行時將指示滑翔機方位的身體平衡訊號與視覺訊號進行對比，以及控制眼睛運動等。即使是我們通常認為的純“體格技能”，比如游泳或體操（這些運動需要謹慎地控制身體的移動），大腦也在其中發揮著重要的作用，研究發現，訓練也造就了大腦的改變。例如，競技跳水運動員與非競技跳水者相比，在測量大腦區域中腦灰質數量的一個指標（即皮層厚度）上，前者在三個特定區域中都更厚一些，所有這三個區域都在覺察和控制身體的移動方面發揮著作用。三個重要細節儘管由於技能不同，具體細節也各不相同，但總的規律不變：經常性的訓練會使大腦中受到訓練挑戰的區域發生改變。大腦通過自身重新佈線的方式來適應這些挑戰，增強其執行那些挑戰所需功能的能力。從那些關於訓練對大腦影響的研究中，我們應當可以得出這樣一條基本資訊，但還有其他更多細節值得一提。第一個值得一提的細節是：訓練對大腦的影響。可能隨著年齡增長，在幾個方面有所不同，最重要的方面是：年輕人的大腦，即兒童和青少年的大腦，比成年人的大腦更具適應能力，因此，年紀越小，訓練產生的影響也越大。因為年輕人的大腦會以諸多不同方式來發育，因此，幼年時期進行的練習，實際上可以塑造後來的發育路線，從而造就更大的改變。這就是“折彎幼枝效應”。如果你將一根剛剛長出來的幼枝稍稍折彎一點點，那麼到最後，那根樹枝生長的位置，可能會發生重大改變；而如果你去折彎已經長成了的樹枝，這種影響則小得多。這種效應的一個例子是，與非音樂家相比，成年鋼琴家大腦的某些區域通常擁有更多的腦白質，這種差別完全由他們在兒童時期經常練習所致。孩子越早開始練鋼琴，長大後腦白質也就越多。因此，儘管你也可以在成年以後再開始學彈鋼琴，但與兒童時期開始學相比，大腦中不會產生更多的腦白質。目前，並沒有人知道這在現實中有怎樣的含義，但一般來講，腦白質增多，可以加快神經訊號的傳送，因此，在兒童時代練習彈鋼琴，似乎能使練習者具有一定神經學上的優勢，這是成年以後練鋼琴無法比擬的。第二個值得一提的細節是，通過超長時間的訓練來發展大腦中的某些部位，可能得付出一些代價。在許多案例中，那些已經超常發展了某項技能或能力的人，在另一些行業或領域則出現了退化。馬圭爾對倫敦計程車司機的研究，也許就是最好的例子。到了四年的訓練結束時，受訓者要麼完成了訓練，成為獲許可的計程車司機，要麼不再嘗試，此時，馬圭爾再用兩種方法測試他們的記憶。一種方法涉及認識不同倫敦地標的位置，對此，已經成為獲許可計程車司機的人比其他實驗物件強得多。第二種方法是空間記憶的標準測試，即在延遲30分鐘之後再記住複雜的圖案，這一次，獲許可的計程車司機，比那些從來沒有接受過計程車司機培訓的實驗物件，表現卻差得多。相反，那些已被淘汰的受訓者與那些從未受過培訓的實驗物件幾乎相差無幾。由於在為期四年的實驗開始之時，所有三組實驗物件在這項記憶測試上的得分都很好，因此，唯一的解釋是，那些獲許可的計程車司機儘管提高了對倫敦街道的記憶，卻導致其他型別的記憶力出現下降。儘管我們不能確定地知道是什麼導致這種現象的發生，但是，似乎那些密集的訓練導致受訓者的大腦將越來越大的部分專門用於這種記憶，從而留給其他型別記憶的腦灰質變少了。最後，由訓練引起的認知和生理變化需要繼續保持。如果停止訓練，它們便開始消失。例如，在沒有重力的太空中待了幾個月的宇航員，一旦回到地球，會發現自己難以正常行走。另外，由於骨折或者韌帶撕裂而停止訓練的運動員，他們無法訓練的肢體將喪失大部分的力量和耐力。同樣的現象也在自願參加研究的運動員身上出現。在這些研究中，他們必須臥床一個月左右的時間。結果，力量下降了，速度減緩了，耐力消失了。同樣的現象，對大腦也是一樣的。馬圭爾研究一組倫敦計程車司機時發現，他們海馬體後部區域中的腦灰質比活躍的計程車司機少一些，不過，依然比那些已經退休、從來沒有當過計程車司機的研究物件多一些。一旦這些計程車司機停止每天都運用自身導航記憶的訓練，那麼，由於這種訓練而引起的大腦改變也將開始消失。"
        },
        {
          "title": "潛能可以被構築",
          "content": "一旦我們以這種方式理解了大腦和身體的適應能力，便開始以完全不同的視角來思考人類的潛力，而且，這將我們引向了一種完全不同的學習路徑。想想這個：大多數人在生活中從來沒有受到特別的身體挑戰。他們坐在辦公桌前，或者即使需要四處走動，也不用走動很多。他們不會奔跑和跳躍，不會去舉重物或者長距離投擲物體，而且不會進行大量的平衡和協調的運動。因此，他們的身體能力處於相當低的水平，儘管對日常活動來說已經足夠，甚至足以步行、騎單車，或在週末的時候玩一玩高爾夫或網球，但遠遠達不到受過高度訓練的運動員擁有的體能。這些“正常”的人們，不能在5分鐘之內奔跑1.5千米，或者在1小時之內跑完16千米；無法把棒球打到90多米的地方去，或者將高爾夫球擊出近300米；他們做不到在冰上做出三週跳的動作，或者在自由體操專案中完成三個後空翻。這些事情需要人們進行艱辛的訓練，通常比大多數人願意做的訓練量大得多，但不管怎樣，這些能力也是能夠培養出來並發展提高的，因為人類的身體具有足夠的適應能力來響應訓練。大部分人做不到這些事情，並不是因為他們不具備做這些事情的能力，而是因為他們滿足於在舒適區中生活，從來沒有嘗試走出舒適區。他們生活在“足夠好”的世界中。對於我們從事的所有心理活動，同樣是這個道理，從寫報告到駕駛汽車，從教課到經營組織，從賣房子到做大腦手術。我們在日常生活中已學到足夠多的東西，但是，一旦我們抵達了那個界限，很少迫使自己超出“足夠好”的範圍。我們很少去挑戰自己的大腦來生產新的腦灰質、腦白質，或者以有望成為倫敦計程車司機的人們或小提琴學生可能採用的方式，對整個大腦進行“重新佈線”。很大程度上，這沒問題。一般說來，“足夠好”就是足夠好。但重要的是記住，選擇總是存在。如果你希望變得更擅長某件事情，你就可以做到。而且，傳統的學習方法與有目的的練習或者刻意練習的方法之間存在著一種關鍵的差別，那便是：傳統方法並不是專門用於挑戰體內平衡的。它假設，不論是有意的還是無意的，這種學習全都涉及發揮你的內在潛力，並且意味著你可以發展某一特定的技能或能力，而不用走出你的舒適區太遠。從這種視角觀察，只要你進行訓練，便可以發展自己的潛力。事實上，訓練也是你唯一能做的。然而，對於刻意練習，我們的目標不僅僅是發掘自己的潛能，而且要構築它，以便從前不可能做到的事情變得可能做到。這要求挑戰體內平衡，也就是走出你的舒適區，並迫使你的大腦或身體來適應。一旦你做到這一點，學習便不再只是執行某些遺傳命運的方式；它變成了一種控制你自己命運的方式，也是一種按照你選擇的方法構築潛力的方式。下一個明顯的問題是：挑戰體內平衡和發展那種潛力的最佳方式是什麼？我們將在本書餘下的大部分內容中回答那個問題，但在那之前，要解決在本章中丟擲的一個問題：我們到底在試圖提升大腦的什麼？我們明顯知道，是什麼改進了我們的身體能力。如果你長出了更多和更大的肌肉纖維，你就會變得更強壯。如果你增加了肌肉的能量貯存、提高了肺活量、改進了心跳能力以及迴圈系統的能力，那你的耐力將得到增強。但是，當你在參加培訓，立志當一位音樂家、數學家、計程車司機或者外科醫生時，你的大腦產生了什麼樣的變化？令人驚奇的是，在所有這些區域中的改變，有一個共同的主題。理解該主題，是理解人們怎樣用心理組成要素在任何一個行業或領域發展並提升超常能力的關鍵。接下來我們會進行討論。"
        }
      ]
    }
    
  ]
}