{
  "indexs": [{
      "chapter": "封面",
      "title":""
    },
    {
      "chapter": "目錄",
      "title":""
    },
    {
      "chapter": "引言",
      "title":"",
      "sections": [{
          "title": "天才存在嗎",
          "content": "為什麼有些人對他們所做的事情如此擅長，擅長到令人不可思議的地步？不論你觀察哪個行業或領域，從競技體育、音樂表演，到科學界、醫學界和商業界，似乎總有幾個非同凡響的人，讓我們對他們能做的事情以及傑出的程度感到炫目。當我們遇到一個如此非同凡響的人時，往往自然而然地認為，這個人生來就比別人優秀。我們經常說，“他真的很有天賦”，或者“她是真正的天才”。但現實的確如此嗎？對這些在其各自行業或領域表現優異的人，比如運動員、音樂家、棋手、醫生、商人、教師，等等，我研究了30多年。我深入細緻地研究了他們的許多細節，包括他們所做的事情，以及怎樣做事情。我暗中觀察他們、採訪他們，而且測試他們。我探索了這些傑出人物的心理狀態、生理機能以及神經解剖學部分。隨著時間的推移，我漸漸懂得，沒錯，這些人的確有著卓越的天才，它們深藏於他們的能力之中。但是，他們的天才，並非人們通常假定的那種，而且，甚至比我們想象的還要強大。最重要的是，這是一種我們每個人都與生俱來的才能，通過適當的方法，我們也一樣可以充分利用。"
        },
        {
          "title": "莫扎特的完美音高",
          "content": "1763年，年輕的沃爾夫岡·阿瑪多伊斯·莫扎特計劃環歐洲旅行演出。正是這次演出，鑄就了他的傳奇。那一年，莫扎特僅僅7歲，身材矮小得只能勉強看到大鍵琴的頂部，但他用自己演奏小提琴及各種鍵盤樂器的技能，深深地迷住了家鄉薩爾茲堡的觀眾。他演奏的樂器，看上去讓人不敢相信，如此小的孩子居然能演奏。但莫扎特還留有另外一手，甚至讓他那個時代的人更加感到震驚。我們知道他的這種更令人震驚的天才，是因為在莫扎特及其家人離開薩爾茲堡開始旅行演出之前不久，莫扎特父親的故鄉奧格斯堡的報紙上發表了一封寫給編輯的信，信中談到了年幼的莫扎特。信的作者寫道，年幼的莫扎特聽到某種樂器演奏出來的調子時，不論是哪種調子，馬上便能準確地辨別出來：是高於中央C音的第二個八度音的升A調，還是低於中央C音的降E調。莫扎特甚至能在某個房間裡聽得出另一間房間裡的人彈奏的調子，而且，他不但能分辨小提琴和古鋼琴演奏出來的調子，還能分辨任何一種樂器的調子。莫扎特的父親是一位作曲家，也是一位音樂教師。他的家裡擺滿了各種各樣的樂器，只要是大家可以想象到的，幾乎應有盡有，而且不僅僅是樂器。莫扎特這個小孩，還可以分辨任何足夠像音樂的聲音的調子，比如時鐘的報時、大鐘的鳴響，以及人們打噴嚏的聲響。在當時，大多數已成年的音樂家，即使是經驗最豐富的，也無法與莫扎特匹敵。他在這方面的奇才，甚至比起他在鋼琴和小提琴上的才華，更能表現出他天生就有的那些神奇才能。當然，如果放在今天，這種能力並非如此高深莫測。比起250年前，今天的我們，不但知道的東西更多，而且大多數人，至少都聽過那些音調。在音樂上，“絕對音高”（absolute pitch）是個技術術語[更多的人稱之為“完美音高”（perfect pitch）]。它異常罕見，大約在每萬人中，只有1個人具備這種能力。這種能力在世界級的音樂家之中，比在我們普通人之中更加罕見，甚至在樂器演奏名家中，也非同尋常：人們認為，這種能力，貝多芬有，勃拉姆斯卻沒有；弗拉基米爾·霍洛維茨有，伊戈爾·斯特拉文斯基卻沒有；弗蘭克·辛納屈有，邁爾斯·戴維斯卻沒有。簡而言之，這似乎是一個絕好的例子，證明某種與生俱來的天賦，往往只有少數一些幸運的人才會天生擁有，其他大多數人並不具備。事實上，至少在200多年的時間裡，人們普遍是這麼認為的。但在過去的幾十年裡，人們對完美音高的理解，出現了極大的差異。如今，人們對完美音高的理解，直指我們人類另一種不同的才華，而不是純粹音樂方面的才華"
        },
        {
          "title": "“天才”是訓練的產物",
          "content": "只是在最近，神經系統科學家才開始懂得，為什麼存在那樣的才華。數十年來，科學家相信，我們的大腦天生就帶有一些極其固定的迴路，而這些迴路決定了我們的能力。你的大腦，要麼對完美音高十分適應，要麼不適應，而且，你沒有太多的辦法去改變它。你可能需要一定程度的訓練，將那種天生的才華充分提升，而且，如果沒有獲得這樣的練習，你的完美音高也許不會得到充分的發揮，但人們一般認為，如果你天生就不具備適當的基因的話，練得再多，也無濟於事。但是，自20世紀90年代以來，研究大腦的研究人員開始意識到，大腦（甚至是成年人的大腦）比我們想象的具有更強的適應能力，這使得我們可以在很大程度上控制大腦能做的事情。特別是，大腦採用以各種方法“重新佈線”的方式，對適當的觸發因子做出響應。神經元之間構成了新的連線，同時，現有的連線要麼得到強化，要麼被弱化，在大腦的某些部分之中，甚至還可能生長新的神經元。這種適應能力，解釋了榊原彩子的研究物件以及莫扎特怎樣培育和提升完美音高：他們的大腦通過發展特定的、能夠擁有完美音高的迴路，對音樂訓練做出響應。迄今為止，我們尚不能辨別那些迴路都是些什麼迴路，也不能說它們看起來是什麼樣子，或者它們到底在做些什麼，但我們知道，它們一定在那裡，而且知道，它們是訓練的產物，並不是某些天生的基因。在完美音高的案例中，當孩子過了6歲以後，大腦的必要的適應能力就會消失，因此，如果完美音高必備的重新佈線還沒有出現的話，那麼，它將永遠消失。（不過，正如我們將在第8章描述的那樣，也有一些例外的情況，讓我們能夠深入瞭解人們如何充分地利用大腦的適應能力）。這種消失，是一種更寬廣現象中的一部分，也就是說，年輕人的大腦和身體的適應能力比成年人更強，因此，有些能力只能在6歲、12歲或18歲之前培養，或者在這些年齡之前更容易培養。儘管如此，在我們整個成年時期，身體和大腦依然都保留著極大的適應能力，這種適應能力，使得成年人甚至老年人也可能通過正確的訓練，培養各種新的能力。天才更懂得利用大腦的適應能力牢記這一點，讓我們回到我在開篇時提出的問題：為什麼有些人對他們所做的事情如此擅長，擅長到令人不可思議的地步？我在對各個不同行業或領域的專家進行的多年研究中發現，他們全都以和榊原彩子的學生同樣的方式培養了自己的能力，也就是說，通過專注的訓練促使大腦改變（有時候根據人們的能力不同，還可以促使身體上的改變），那些改變使得他們能夠做到在正常情況下可能做不到的事情。沒錯，在某些案例中，基因遺傳確實也很重要，特別是在身高或其他生理因素十分重要的領域或行業。比如，某位男性的身高基因為165釐米左右，那麼，他可能發現自己很難成為一位職業籃球運動員；同樣，一位身高接近183釐米的女性，將會發現自己事實上不可能成為一名具有較高水準的藝術體操運動員。同時，如我們將在本書後面的內容中討論的那樣，基因可能還以許多其他的方式影響著某人的成就，特別是那些影響著某人有多大的可能勤奮並正確地練習的基因。但從數十年的研究中發出的清晰訊號是：不論基因遺傳可能在“天才”取得的成就中發揮著什麼作用，這些人擁有的重要才華，與我們每個人都擁有的才華是一樣的。也就是說，他們和我們一樣，大腦和身體都具有適應能力，只是比我們更多地利用了那一能力而已。如果和那些傑出人物交談一番，你會發現，他們全都在某種程度上理解這一點。他們也許對認知適應的概念不太熟悉，但很少接受這樣的觀點：他們在自己行業或領域中達到巔峰，是因為他們遺傳了優秀的基因。他們知道，培養卓越的技能，是因為他們首先就具有了那些方面的豐富經驗。在這個主題上，我最喜歡的證據是曾十次入選NBA全明星陣容、聯盟歷史上最偉大三分射手的雷·阿倫（Ray Allen）。多年前，ESPN評論員傑奇·麥克馬蘭（Jackie MacMullan）曾寫過一篇關於雷·阿倫的文章，那時，後者即將創造三分籃的歷史紀錄。在說到雷·阿倫的故事時，麥克馬蘭提道，另一位籃球評論員曾說，雷·阿倫天生就是三分王。換句話講，他具有三分射手的天賦。但雷·阿倫並不贊同這種說法。他告訴麥克馬蘭，“我和身邊的許多人圍繞這個話題爭論過。當人們說，上帝賜予我傑出的稟賦，讓我在比賽中完成漂亮的三分跳投時，那真是氣死我了。我告訴這些人，‘不要低估我每天付出的巨大努力。’不是一天兩天，是每一天。問一問我曾經的隊友，哪個人在訓練投籃的時候最為刻苦。回到西雅圖和密爾沃基，問一問那些球員們。他們的回答一定是我。”事實上，正如麥克馬蘭說過的那樣，如果問過雷·阿倫高中籃球隊的教練，你會發現，雷·阿倫在高中時代的跳投，並不比其他隊友更出色；事實上，他的表現還很差。但他不向命運低頭，而是掌控著自己的命運，一直在心無旁騖地刻苦訓練。隨著時間的推移，他將自己的三分跳投訓練得如此嫻熟自然，動作優美，以至於人們以為他天生就是個傑出的三分射手。他只是利用了他的天才，他真正的天才。"
        },
        {
          "title": "本書將告訴我們什麼",
          "content": "本書描述莫扎特、榊原彩子的研究物件以及雷·阿倫等人共同擁有的才華，也就是說：通過正確的訓練與練習進行創造的能力。這種能力與才華，只有通過利用人類的大腦與身體不可思議的適應能力，才可能擁有。此外，本書還闡述了這樣一個觀點：為了提高人們在選擇的行業或領域中的表現和水平，每一個人能以怎樣的方式將其才能發揮出來。最後，本書最廣泛的意義在於，它介紹了一種關於人類潛力的新思考方式，提醒著我們：我們擁有更大的力量來掌控自己的人生，但我們以前卻從來沒有意識到。自遠古時代開始，人們通常以為，某個人在任何特定行業或領域內的潛力，不可避免地受到天生才能的限制。上鋼琴課的人很多，但只有那些有著特殊天才的人們才可能成長為真正偉大的鋼琴家或作曲家。每個孩子在學校裡都上數學課，但只有少數一些人長大後能成為數學家、物理學家或工程師。根據這種觀點，我們每個人一生下來，都具有一些固定的潛力，有的具有音樂潛力，有的在數學方面有天賦，有的生來就適合體育運動，有的天生精於商道，我們可以選擇發展（或者不發展）那些潛力中的任何一種，但不可能填補那些特定的“缺陷”。因此，教育或訓練的目的變成了幫助人們發揮他的潛力，以便儘可能充分地填補那些缺陷。這意味著，可以採用一種特定的方法來進行那種假設了預定極限的學習。但我們現在知道，這種預先確定的能力並不存在。大腦是可適應的，而訓練可以創造一些我們以前並未擁有的技能（比如完美音高）。這是具有顛覆意義的觀點，因為如今的學習變成了一種創造能力的方式，而不是使人們能學會充分利用他們的內在才華。在這個全新的世界，認為人們天生就具有一些固定潛力的觀點已經站不住腳了；相反，潛力好比可延伸的血管，能夠通過我們一生中經歷的各種各樣的事情來創造。學習不再是挖掘某人潛力的方式，而是發展這種潛力的方式。我們可以創造自己的潛力。無論我們的目的是成為鋼琴家，或者只求自娛自樂，能彈得一手漂亮的鋼琴，是加入美國職業高爾夫巡迴賽，或者只為了能打幾個好球，都是這麼回事。那麼問題來了：我們怎麼做到？我們怎麼充分利用這種才華，並在我們選擇的行業或領域中塑造我們的能力？過去幾十年間，我的大部分研究一直致力於回答這個問題，也就是說，致力於辨別和理解提高我們在某種特定活動中表現和水平的最佳方法。簡單地講，我一直在問，哪些方法管用？哪些方法不管用？為什麼？令人震驚的是，絕大多數曾圍繞這個普遍主題著書立說或者發表評論的人，幾乎沒有關注過這個問題。過去幾年裡，許多作者在他們寫的書中認為，我們一直過於高估了天生才能的作用，低估了諸如機會、動機和努力的價值。我十分同意這種觀點，而且，讓人們知道他們可以通過練習來提高，並且大幅度地提高，一定十分重要。否則，他們可能連試一下的動機都沒有。但有些時候，這些書籍給人們留下的印象是：光靠真誠的願望與刻苦的努力，就足以提高了，“只要你努力朝前奮進，終將達到目標”。但這也是錯誤的。在足夠長的時間內進行正確練習，可以實現改進。再無其他。本書詳細地描述了“正確的練習”是什麼，以及可以怎樣發揮它的作用。我們從一個相對較新的心理學領域中找到了涉及這種練習的細節，最好是將這個領域描述為“專業特長科學”。這個新的領域著眼於理解“傑出人物”的能力，所謂“傑出人物”，就是那些在他們所從事的行業或領域中表現最突出的人們，以及那些登上了巔峰的人們。同時，我還發表了關於這一主題的幾本學術專著，包括1991年出版的《從平庸到卓越：前景與侷限》（Toward aGeneral Theory of Expertise：Prospects and Limits），1996年的《通向卓越之路》（The Road to Excellence），以及2006年的《劍橋專業特長與傑出表現指南》（The Cambridge Handbook of Expertise and Expert Performance）等。我們中那些在這一專業領域（指前面提到的“專業特長科學”的領域）從事研究的人，調查了是什麼因素使這些傑出人物從其他人中脫穎而出。我們還嘗試著逐步研究這些專家級的傑出人物如何隨著時間的推移而提高他們的表現和水平，以及他們在提高的時候，其心理和生理能力出現了怎樣的改變。20多年前，在研究了一系列行業或領域中的專家級人物之後，我的同事和我開始意識到，不論在什麼行業或領域，提高表現與水平的最有效方法，全都遵循一系列普遍原則。我們把這種通用的方法命名為“刻意練習”（deliberate practice）。如今，對於在任何一個行業或領域中，希望充分利用人們的適應能力這種才能來學習新的技能與能力的所有人來講，刻意練習依然是黃金標準，而且，它是本書的核心內容。本書的前半部分描述了刻意練習是什麼，為什麼管用，以及傑出人物如何運用它來發展傑出的能力。為了做好這些，我們必須研究各種不同型別的練習，從最簡單的到最複雜的，並探索它們之間的差別。不同型別的練習的關鍵差別在於，它們對人類的大腦和身體的適應能力的利用程度各不相同，因此，我們將花一些時間來探討那種適應能力，以及是什麼觸發了那種能力。我們還探究，到底我們的大腦發生了哪種變化來響應刻意練習。獲取專業特長，很大程度上是改進人們的心理過程（在某些行業或領域中，還包括改進那些控制著身體運動的心理過程），而且，人們已經很好地理解了身體功能的變化（比如力量增大、柔韌性增強、耐力增強等），因此，本書著重闡述傑出人物的心理層面，儘管在體育專案以及其他運動專案之中，人們專業特長的提升一定有著明顯的體能要素。在進行了這些探索之後，我們將研究，所有這些要素是如何在傑出人物的身上融合到一起的。這種融合是個漫長的過程，通常需要10年之久，甚至更長的時間。接下來，在簡短的插曲中，我們更仔細地研究了先天稟賦的問題，以及這個問題可能怎樣限制了有些人在追求卓越時走得多遠。我們有些生理特徵確實是天生的，比如身高和體形，它們可能影響在各個體育專案以及其他體育活動中的表現，而且無法通過練習來改變。不過，更多的特點在傑出人物的卓越表現中發揮著作用，而它們是可以通過正確的練習來改變的，至少在人們一生中的某個階段可以改變。更一般地講，遺傳因素與練習活動之間存在著複雜的交織，而我們才剛剛開始瞭解。有些遺傳因素可能影響一個人投入到持久的刻意練習之中去的能力，例如，遺傳因素有可能限制某人每天都長時間集中注意力的能力。相反，進行大量練習，可能影響到身體中的基因怎樣開啟和關閉。本書的最後部分，讓我們從對傑出人物的研究中受益，特別是對刻意練習有了深入的瞭解，並解釋了這對我們其他人來說到底意味著什麼。圍繞怎樣將刻意練習應用到專業組織中的工作，以提高員工的績效，我提了一些具體的建議，同時還建議個人可以怎樣進行刻意練習，以便在他們感興趣的行業和領域中變得更加優秀，甚至還就學校可以怎樣在課堂中應用刻意練習提出了建議。儘管刻意練習的原則是通過研究傑出人物發現的，但這些原則本身，可以由任何立志於改進任何事情的人們所使用，即使只是稍稍改進也無妨。想提高你的網球水平嗎？刻意練習。寫作水平？刻意練習。銷售技能？刻意練習。由於研發刻意練習是專門用於幫助人們變成他們行業或領域中的世界最傑出人物，而不僅僅是變得“足夠好”，因此，這是迄今為止我們發現的最強大的學習方法。你可以從這個角度來思考：假設你想去爬山，你不確定你想爬多高，山路看起來蜿蜒曲折，令人望而生畏，但你知道，你想比現在所處的位置爬得更高一些。你可以簡單地選擇一條看起來很有希望的路徑，並期望是最好的，但你可能走不了很遠。或者，你可以依靠一個曾登上過頂峰、並瞭解最佳路線的嚮導，不論你決定自己要爬多高，這會保證你以最有效的方式登山。這種最佳的方法就是刻意練習，而本書就是你的嚮導。本書將向你顯示登上巔峰的路徑；至於在那條路徑上能走多遠，則取決於你自己。"
        }
      ]
    },
    {
      "chapter": "第1章",
      "title": "有目的的練習",
      "sections": [{
          "title": "",
          "content": "我們剛剛進行到第四次練習，史蒂夫·法隆（Steve Faloon）似乎開始洩氣了。那是我做的一個實驗剛剛進行到第一個星期的星期三時的情形。我起初預計，實驗將持續兩三個月之久。但從史蒂夫對我說的話裡，我能感到這個實驗似乎沒什麼太大的意義進行下去了。他對我說：“我的極限似乎在8個數字或者9個數字。”我當時對他說的話錄了音，並且在我們每次上課的時候都會播放。他繼續說，“特別是9個數字，不管我採用什麼方法來記，都很難記住。你知道，我有我自己的方法。但無論我用什麼方法，似乎都不重要了——太難了。”史蒂夫是卡內基梅隆大學的學生，我在那裡教書的時候，曾聘請他參加這個實驗。他一星期和我見幾次面，任務很簡單：記住一串數字。我以大約每秒一個數字的速度，向他讀出一串數字，“7…4…0…1…1…9”，諸如此類，史蒂夫則努力記住所有那些數字，並在我念完之後，把數字背給我聽。實驗的目的是看一看史蒂夫能在多大程度上通過練習來提高記憶。現在，我們進行了四次練習，每次練習1小時，他能穩定地記住7個數字了，也就是說，能夠記住當地的一個電話號碼。通常情況下，他也可以記住8個數字，但如果是9個數字，就有些記住不了。他還根本沒去想記住10個數字組成的數字串。此刻，鑑於他在前幾次練習裡已經倍感失敗，他十分確定，他再也不可能有任何提高了。"
        },
        {
          "title": "史蒂夫的超強記憶力",
          "content": "史蒂夫不知道（但我知道）的是，那個時候，絕大多數的心理學研究成果認為，他說的是對的。根據數十年的研究成果顯示，人們可以保留在短時記憶中的事物數量，有著嚴格的限制，這也正是大腦用來在短時間內記住少量資訊的那種型別的記憶。如果某個朋友給你他的地址，在你把它寫下來之前，你的短時記憶只能記住一段時間。或者，如果你在心裡將好幾個兩位數的數字相乘，你的短時記憶就是你能保持追蹤所有中間片斷的位置：“讓我們來看：14乘以27……首先，四七二十八，因此，個位是8，十位是2，然後，二四得八……”，依此類推。這就是它被稱為“短期”的原因。除非你花時間一遍一遍地對自己重複，並因此將其轉移到你的長時記憶之中，否則，過了五分鐘，你不會記得住朋友的地址或者那些中間的數字。短時記憶的問題，也正是史蒂夫面臨的問題，那便是：我們的大腦對於可以將多少事物立即儲存在短時記憶中，有著嚴格的限制，這一限制通常約為7件事物，也就是說，大腦足以記住一個當地的電話號碼，但記不住社會保險號碼。長時記憶則不存在這些限制（事實上，到目前為止，還沒有人發現長時記憶的上限），但它要花很長的時間來進行。如果給你足夠長的時間來記，你可以記住十幾個甚至數百個電話號碼，但我和史蒂夫進行的實驗，設計的目的是快速地說出數字，迫使他只能運用短時記憶。我在讀那些數字的時候，是以每秒鐘1個數字的速度，使得他很難將其轉移到長時記憶中去，因此，在記到大約8位數字或9位數字的時候，他覺得再也記不住了，這一點兒也不足為奇。儘管這樣，我仍希望他能做得更好一點兒。我之所以要進行這次研究，是因為我在搜尋一些古老的科學研究時，發現了一篇默默無聞的論文。論文發表在《美國心理學期刊》（American Journal of Psychology）1929年那一期上，由賓夕法尼亞大學兩位心理學家保琳·馬丁（Pauline Martin）和薩繆爾·費恩伯格（Samuel Fernberger）撰寫。馬丁和費恩伯格指出，他們的實驗物件，即兩名大學生，在經過4個月的練習之後，能記住的數字數量增多了，即使他們聽到的數字大約是以每秒鐘1個數字的速度讀出。經過長期練習之後，他們能記住更多的數字。其中的一個學生將平均9個數字增加到13個，另一個學生則從11個數字增加到15個數字。一直以來，心理學研究界忽略或遺忘了這一研究結果，但我馬上關注起來。這種提高真的可能嗎？如果可能，怎樣變成可能的？馬丁和費恩伯格並沒有提供任何細節來描述那兩位學生究竟如何提升他們對數字的記憶，但恰好是這個問題，引起了我最大的興趣。看到他們的研究成果時，我剛剛從大學畢業，當時最感興趣的是，當人們在瞭解某些事情或提升某項技能時，其心理過程會發生什麼。為了寫好我的畢業論文，我精心準備了一個被稱為“有聲思維協議”（the think-aloud protocol）的心理學研究工具，它專門用於研究那些心理過程。因此，在和卡內基梅隆大學的知名心理學教授比爾·蔡斯（Bill Chase）合作時，我開始重新進行馬丁和費恩伯格的研究，這一次，我打算觀察，假如我們的研究物件真的提升了的話，他到底怎樣提升了對數字的記憶。持續練習，突破極限我們招聘的實驗物件是史蒂夫·法隆，在我們期待著找到他時，他只是一名普通的大學生。那時他剛唸完大三，主修心理學，對兒童早期發展感興趣。他的學業測試上的成績與卡內基梅隆大學的其他學生相差無幾。他個子瘦高，長著濃密的深棕色頭髮，待人友善、性格活潑、熱情四射。此外，他還堅持長跑。這一事實，當時似乎對我們的實驗沒有任何意義，但後來證明卻至關重要。史蒂夫第一天來參加記憶力的實驗時，表現完全是正常的水平。他通常可以記住7個數字，有時候是8個，但不會再多。如果你從街上隨便找個人來做實驗，可能他的表現和史蒂夫第一天的表現一模一樣。到了星期二、星期三和星期四，他稍稍好一些了，平均恰好能記住9個數字，但依然不比普通人優秀。史蒂夫說，他覺得後面這幾天和第一天相比，主要的差別在於，他知道自己可以預料到記憶測試會是什麼結果，因而感到更加舒服。到了星期四的訓練結束時，史蒂夫向我解釋了為什麼他覺得自己不可能再有所提高了。接下來，星期五發生的一些事情，改變了一切。史蒂夫找到了突破的方法。我和他練習的方法是這樣的：我首先從一個隨機的、有5個數字的數字串開始，如果史蒂夫記住了（他做到了這點），我會讀6個數字。如果他又記住了，我再增加到7個數字。依此類推。每次給數字串上增加1個數字，他都可以記住。如果他記錯了，我會將數字串的長度縮短2個數字，然後再繼續。史蒂夫時刻都在以這種方法接受挑戰，但挑戰難度並不是太大。我給他念的數字串，恰好處於他能記住與不能記住的界限。到那個星期五，史蒂夫就越過了他原本以為的自己的極限。在此之前，只用訓練幾次，他便能正確記住9個數字的數字串，但他從來沒有正確無誤地記住過10個數字的數字串，因此，一直沒有機會去嘗試記住11個或更多數字。但他在第五次訓練時，開始超常發揮。我們首先試了三次，分別記住5個、6個和7個數字，沒有一點兒問題，到第四次的時候，也就是8個數字的時候，他記錯了，然後再返回來：6個數字，對了；7個數字，對了；8個數字，對了；9個數字，也對了。然後我讀出10個數字的串，5718866610，他也記住了。等到我念出11個數字時，他沒能記住，於是又從9個數字開始重來。他記住了9個數字和10個數字，我再次給他讀出了11個數字的數字串，90756629867，這一次，他毫不費力地把整個數字串背了下來。那比他之前能夠記住的數字多了兩個，儘管另外增加兩個數字，看起來似乎不是特別令人印象深刻，但實際上，考慮到史蒂夫在過去的幾天裡確定自己已達到了只能記住8~9個數字的“自然”極限，這已經是巨大的成績了。他找到了突破那一極限的方法。那只是我職業生涯中一段最令人驚奇的旅程的開始。從那時起，史蒂夫開始緩慢而穩定地提高著記住數字串的能力。到第16次練習時，他能穩定地記住20個數字了，遠遠超出比爾和我對他能力的想象。練習了一百多次以後，他的記錄達到了40個數字，比任何人都多，甚至專業研究記憶術的人，也達不到他的水平。而且，他還在不斷進步。史蒂夫和我一同進行了二百次練習，所有這些練習結束時，他能記住82個數字了。82！思考片刻，你會意識到，這種記憶力到底有多麼不可思議。以下是史蒂夫記住的82個隨機的數字：0326443449602221328209301020391832373927788917267653245037746120179094345510355530想象一下，在聽到別人向你以每秒一個數字的速度念出這82個數字，然後你能把它們全部記下來。這是一種什麼樣的情形！但是，在我們的實驗持續兩年左右的時間後，史蒂夫達到了這樣的水平。他甚至不知道自己可以做到所有這些，只是一個星期接著一個星期地持續練習罷了。"
        },
        {
          "title": "各領域的傑出人物都靠大量練習",
          "content": "1908年，約翰尼·海耶斯（Johnny Hayes）奪得奧運會馬拉松冠軍，當時的報紙把這場比賽描述為“20世紀最偉大的比賽”。海耶斯不僅奪冠了，還創造了馬拉松世界紀錄，成績是2小時55分18秒。如今，距離海耶斯奪冠一個多世紀以後，馬拉松的世界紀錄已經重新整理為2小時2分57秒，比他創造的世界紀錄快了近30%，而且，如果你是年齡為18~34歲的男性，想參加波士頓馬拉松比賽，那麼，只有成績不低於3小時5分，才可能獲得參賽資格。簡單地講，海耶斯在1908年創造的世界紀錄，如果換到今天的波士頓馬拉松比賽中，只夠剛剛贏得參賽資格。要知道，這項比賽吸引了大約3萬名長跑者參加。同樣是在1908年的夏季奧運會上，在男子跳水比賽中，幾乎出現了一場災難。其中一位跳水運動員在嘗試空翻兩週這個動作時，差點兒身受重傷。幾個月後釋出的官方報道認為，跳水是項危險的運動，建議未來的奧運會禁止該專案。如今，空翻兩週已成為跳水專案中的入門級動作，即使是10歲的孩子參加的比賽，也必須會這個動作，到了高中，最佳的跳水運動員可以完成空翻四周半的動作了。世界級運動員甚至可以做更加高難的動作，比如迴旋，也就是說，向後空翻兩週半，再加兩週半轉體。我們很難想象，20世紀初期那些認為空翻兩週屬於危險動作的專家，會怎樣看回旋這個動作，但我猜，如果當時有人具有這樣的想象力，猜測到今後的跳水運動會出現類似迴旋的高難度動作的話，那些專家一定會認為這是個笑話，絕不可能做到。在20世紀30年代早期，阿爾弗雷德·柯爾託（Alfred Cortot）是世界上最知名的古典音樂家，他演繹的《肖邦24首練習曲》被認為是權威的演繹。而如今的音樂導師們往往把類似的表演作為反面教材加以批判，批評家們抱怨柯爾託採用的那種粗心大意的彈奏方法，而且，每一位職業鋼琴家在彈奏同樣這些練習曲時，有可能運用比柯爾託嫻熟得多的技能。事實上，音樂批評家安東尼·托馬西尼（Anthony Tommasini）在《紐約時報》上一度發表評論，認為自柯爾託的時代以來，人類的音樂能力得到了大幅度提高，以至於柯爾託當時的水平，如果放在今天，可能連茱莉亞音樂學院的入學考試都通不過。1973年，加拿大人大衛·理查德·斯賓塞（David Richard Spencer）背誦圓周率小數點之後的數字時，創下了前無古人的紀錄：511位。五年之後，好幾個人在一系列比賽中爭著創下新紀錄，結果，這個紀錄最終屬於一位名叫大衛·沙克爾（David Sanker）的美國人，他背誦了圓周率小數點之後的1萬個數字。2015年，該紀錄被塵封了30多年之久以後，來自印度的拉吉維爾·米納（Rajveer Meena）奪得了冠軍，再度創下紀錄，背誦了小數點之後的7萬個數字，這使得他花了整整24小時零4分鐘來背誦。不過，一位名叫原口證（Akira Haraguchi）的日本人聲稱背誦了更令人不可思議的10萬個數字，或者，我們換個角度來想，這一紀錄是42年前的世界紀錄的近200倍！這些例子都不是唯一的。我們生活的這個世界，許多人擁有著超常的能力，那些能力勝過人類歷史上任何時代的人們所擁有的能力，如果“穿越”到以前的時代去，都會被當時的人們認為不可能。想一想羅傑·費德勒（Roger Federer）在網球專案中的神奇表現，或者想一想麥凱拉·馬羅尼（McKayla Maroney）在2012年倫敦奧運會上的驚人一跳：先是一個踺子翻，翻到木馬上方，而後在拱頂處一個後手翻，接著，麥凱拉在木馬的上方高高地、呈弧線地飛起來，完成了兩圈半的轉體，再穩穩地落地，並且完全控制住了自己的身體。有一些著名的國際象棋特級大師能同時進行幾十場比賽，還矇眼進行；而且，似乎總能源源不斷地湧現一些年輕的音樂神童，他們既能彈鋼琴、拉小提琴和大提琴，還能吹長笛，各種樂器信手拈來，如果放到100年前，一定會讓音樂迷們瞪大了眼睛，感到無比震驚。他們練習，大量地練習儘管這些能力非常卓越，但關於這些人如何開發這些超常能力，卻並沒有祕密可言。他們練習，大量地練習。在長達一個世紀的時間裡，馬拉松的世界紀錄並不是因為人們天生就具有長途奔跑的基因而提高了30%。20世紀下半葉出生的人們，也不是因為突然之間擁有了一些天賦，就能彈奏肖邦的曲子或拉赫馬尼諾夫的曲子，或者記住數十萬個隨機的數字了。相反，在20世紀下半葉，我們看到的是，不同行業或領域的人們投入訓練的時長在穩定地增長，同時，訓練方法也日益高階。在許多行業或領域之中尤其如此，特別是那些高度競爭性的領域，比如音樂演奏和舞蹈、體育運動中的個人專案和團體專案，以及其他的競賽。這種在訓練的數量與精細程度上的與時俱進，使不同行業或領域中的人們的能力穩定提高，這種提高，如果逐年來看，並非總是顯而易見，但跨越幾十年的時間，便十分驚人了。在吉尼斯世界紀錄中，你可以看到這種訓練的結果，有時候甚至讓你感到無比奇特。翻開吉尼斯世界紀錄大全，或者訪問其線上版本，你會發現一些世界紀錄保持者的神奇表現，比如美國教師芭芭拉·布萊克伯恩（Barbara Blackburn），她能以每分鐘212個單詞的速度打字；斯洛維尼亞的馬可·巴羅什（Marko Baloh）曾在24小時裡騎單車905千米；而印度的維卡斯·沙馬（Vikas Sharma）只用了僅1分鐘時間，便計算出了12個大數字的方根，每個數字的長度介於20位到41位數字之間，求出的方根從17次方到50次方不等。最後的那次計算，也許是所有計算中最令人印象深刻的一次，因為沙馬能在僅僅6秒鐘內進行12次連續而艱難的心算，這甚至比許多人把數字輸入到計算器中並讀出計算結果的時間還要短。最有效的練習形式我收到過一封由吉尼斯世界紀錄保持者鮑勃J.費舍爾（Bob J.Fisher）寫來的電子郵件，他一度在籃球的自由投籃專案中保持著12項不同的世界紀錄。他的紀錄包括：在30秒鐘之內實現最多次數的自由投籃（33次）、在10分鐘之內最多次數的自由投籃（448次）以及在1小時之內最多次數的自由投籃（2371次）。鮑勃在郵件中告訴我，他看過我撰寫的關於練習效果的研究成果，並將他從那些研究中學到的東西運用起來，以提高自己自由投籃的能力，這使得他比世界上任何人都投得更快。那些研究，全都以我在20世紀70年代末與史蒂夫·法隆所做的實驗為基礎。自那以後，我嘔心瀝血地投入到研究之中，以理解練習到底可以怎樣幫助我們創造新的能力和拓展已有的能力，同時特別關注那些運用反覆不斷的練習，最終成為他們所在行業或領域中世界最佳的人。在對這些優中再優的人們進行了數十年的研究之後（為運用精確的術語，我們把他們叫作“傑出人物”），我發現，不論什麼行業或領域，音樂也好，體育也好，象棋也好，其他任何行業或領域也罷，最有效的那些練習，全都遵循同樣一些普遍原則。那些用來將前途看好的音樂家培養成音樂會鋼琴家的教學方法，與將一位普通舞蹈演員培養成芭蕾舞團首席女演員所採用的方法，或者將一位國際象棋棋手培養成大師所採用的方法，為什麼都有關聯呢？答案是：在任何行業或領域之中，最有效的和最強大的那類練習，都通過充分利用人類的身體與大腦的適應能力，來逐步地塑造和提升他們的技能，以做到一些過去不可能的事情。如果你希望發展一種真正有效的練習方法，比如打造世界級的體操運動員，或者是教出一些能夠進行腹腔鏡手術的醫生，那麼這種方法需要考慮到在促使身體和大腦的改變上，哪些可以奏效，哪些無法奏效。因此，所有真正高效的方法，基本上都以同樣的方式起作用。這些見解全都是相對較新的，而且並非所有在過去一個多世紀裡發揮了令人難以置信的超常表現和取得令人不可思議的進步的導師、教練和選手，都運用了這些見解。相反，他們的進步，都是通過反覆試驗才取得的，參與這些試驗的人們，其實並不知道為什麼某種特定的練習方法可能有效。此外，在各個不同行業或領域中的從業人員，只是各自對他們自己的身體條件有一定的瞭解，並不知道所有這些都相互關聯，比如，全心練習三圈半跳躍的滑冰運動員所遵循的一系列普遍原則，與專心練習莫扎特奏鳴曲的鋼琴家所遵循的原則其實是一樣的。因此，設想一下，如果清楚地瞭解了培養專業特長的最佳方法，可以鼓舞和引導人們怎樣付出努力去追求卓越。同時設想一下，如果我們把在體育、音樂和國際象棋等領域中被證明十分有效的方法運用到其他行業或領域中那些致力於學習和提高的人們身上，從在校學生的教育，到醫生、工程師、飛行員、商界人士，以及各種各樣的員工的培養和提升，等等，可以取得怎樣令人咋舌的卓越業績。我相信，如果我們對有效練習原則進行研究，並且運用從這些研究中得到的經驗，那我們完全可以實現我們曾見證過的、在過去一個多世紀之中各行各業和各個領域的人們取得的令人驚歎的進步。某種程度上，各種各樣的練習都可能有效，但其中一種特殊的形式則是黃金標準，我在20世紀90年代初期稱之為“刻意練習”。這是我們知道的最有效和最強大的練習形式，而且，對刻意練習原則的運用，是為任何行業或領域策劃和設計訓練方法的最佳方式。"
        },
        {
          "title": "從有目的的練習講起",
          "content": "本書中的絕大部分內容將探索刻意練習是什麼、它為何如此有效，以及怎樣在各種不同的情形中運用它。但在我們深入研究刻意練習的細節之時，最好是稍稍花一些時間來了解某些更為基本的練習，也就是大多數人已經在某種程度上經歷過的那種練習。學習新技能的一般方法讓我們首先來看人們一般是怎樣學習某種新技能的，比如開車、彈鋼琴、做長除法、畫人物畫、編寫程式碼，或者許多其他事情。為了列舉一個特定的例子，讓我們假設你在學習打網球。你一定在電視上看過網球比賽，看起來很有趣，或者說，你的一些朋友喜歡打網球，你也想加入他們的行列。因此，你買回了一些網球裝備，包括球鞋、防汗帶、球拍以及球，等等。現在，你決心開始學習，但你不知道打網球的第一件事到底是什麼，你甚至還不知道怎麼握拍，因此，你得花錢去上一些課，聽網球教練進行講解，或者請某位朋友告訴你一些基本知識。你可能還會花一些時間去練習發球，一遍一遍地練習朝牆上擊球，直到你非常確定你可以對著牆來“打比賽”了。在那以後，你再回頭找你的教練或朋友，請他們再教你一次，然後你再花更多時間訓練，之後再上課、再訓練，過了一段時間，你覺得自己可以和別人一起打了。你依然不是很優秀，但你的朋友有耐心，每個人都在幫你提高和進步。你不斷地一個人練習，並且經常吸取一些成功的經驗，隨著時間的推移，你犯那些真正讓你尷尬的錯誤的可能性越來越小了，比如擊不中球，或者在雙打時直接把球打到隊友的後背上，等等。你對每一次擊球都越來越熟練，甚至還可以背後接球了，有時候，當你面對對手凶狠的接球時，能像職業球員那樣漂亮地把球回過去（或者，你對自己說，你感覺就像是職業球員）。你已經達到了一種舒服的境界，可以外出和別人打上幾盤，並且即使是比賽，也感到很有趣。你非常清楚自己在做什麼，每一次擊球，都變成了自然而然的動作。打球的時候，你不必想太多了。所以，隨著每個週末都和朋友打球，你開始喜歡比賽和訓練了。你變成了一位網球運動員。那也就是說，你已經在傳統意義上“學會了”打網球，你的目標就是練到這樣的水平：在球場上，你的所有動作都是自動做出的，你的表現也被人們所接受，不需要太多的思考，如此一來，你可以真正在球場上放鬆，享受比賽。到這個時候，即使你對自己打球的水平並不是徹底滿意，但你的進步是實實在在的。你已經掌握了容易的技能。但你很快便會發現，你依然有一些弱點，不論你多麼經常地和朋友打球，這些弱點總是暴露出來。比如，也許每次用反手來接那種直奔你胸前、稍稍帶點旋轉的球時，你總是接不到。你知道這個弱點，而對手也注意到了這一點，每次都有意打出這種球，逼你失誤。對此，你感到挫敗不已。不管怎樣，由於這並不會經常發生，而且你永遠不知道對手什麼時候打出這種球來，因此，你沒有機會繼續去改進，每次面對這種球，你總是以幾乎一模一樣的方式漏接這種球。在我們學習任何一項技能時，從烘餅乾到寫一段說明文，我們全都遵循很大程度上相同的模式。首先，一般性地瞭解我們想做些什麼，從導師、教練、書籍或網站上獲得一些指導，然後開始練習，直到我們達到可接受的水平，接下來，讓這種技能變成自動的、自然而然的。這種方式並沒有錯。我們在生活中所做的事情，很多只需要我們達到中等水平便可以了。如果你想把汽車安全地從甲地開到乙地，或者在彈鋼琴時能熟練彈好《獻給愛麗絲》這首曲子，那麼，你只需要採用這種辦法就行了。但在這裡，你要理解一件非常重要的事情：一旦你已經達到了這種令你滿意的技能水平，而且能做到自然而然地表現出你的水平，無論是開車、打網球還是烘焙餅乾，你就已經不再進步了。人們通常錯誤地理解這種現象，因為他們自以為，繼續開車、打網球或烘焙餅乾，就是一種形式的練習，如果不停地做下去，自己一定能夠更擅長，也許進步較為緩慢，但最終還是會更出色。人們認為，開了20多年車的老司機，一定會比只開了5年車的司機更擅長開車；行醫20年的醫生，一定會比只行醫5年的醫生更優秀；教了20年書的老師，一定會比只教了5年書的老師能力更強。但是，現實並不是這樣。研究表明，一般而言，一旦某個人的表現達到了“可接受”的水平，並且可以做到自動化，那麼，再多“練習”幾年，也不會有什麼進步。甚至說，在本行業幹了20年的醫生、老師或司機，可能還稍稍比那些只幹了5年的人差一些，原因在於，如果沒有刻意地去提高，這些自動化的能力會緩慢地退化。有目的的練習VS天真的練習如果對這種自動化的表現並不滿意，你要做什麼？如果你是一位工作了10年之久的老師，你想做一些事情，讓學生對你上的課更感興趣，並讓你在課堂上更加高效，你該做什麼？你基本上每個週末都打高爾夫球，想再提高一些，該怎麼辦？你在一家廣告公司擔任打字員，想讓別人對你的打字速度感到驚歎，又該怎麼辦？這便是史蒂夫·法隆在經過幾次練習之後發現他自己所處的情形。在那一刻，他對自己能夠聽到一串數字、把它們記下來，然後再念給我聽等，感到很滿意，而且，由於大家知道，短時記憶存在侷限，所以，他的表現也和人們期望的差不多，中規中矩。他原本可以不停地這樣記下去，在經過一次又一次的練習之後，最多能記住8個或9個數字。但他並沒這樣做。他參加了我設計的這個實驗，而我設計這個實驗的初衷，就是使他持續不斷地接受挑戰，以便每次都能比上次多記住一位數字，同時，也因為他是那種天生就喜歡挑戰的人，所以，他在逼迫自己變得更優秀。他採用的這種方法，我們稱為“有目的的練習”，事實證明，這種方法對他來說是不可思議的成功。正如我們接下來將看到的那樣，這種方法並非總是如此成功，但它比通常的方法更有效一些，而且，這是通向刻意練習的第一步，而我們的最終目標便是刻意練習。有目的的練習具有幾個特徵，使得它與我們所說的“天真的練習”區分開來。所謂“天真的練習”，基本上只是反覆地做某件事情，並指望只靠那種反覆，就能提高表現和水平。史蒂夫·奧爾（Steve Oare）是威奇托大學從事音樂教育的專家，他曾提供過一段假想的對話，假設對話在一位音樂導師和年輕學生之間進行。這種關於練習的對話，音樂導師經常會跟學生講。在這個例子中，導師試圖搞懂為什麼年輕的學生一直沒有進步。導師：從你的練習清單可以看出，你每天練習1小時，但你每次測試的時候，總是隻有C的成績。能不能解釋一下原因？學生：我不知道發生了什麼！我昨天晚上都演奏了！導師：你演奏了多少次？學生：10次或者20次。導師：你彈對了多少次？學生：唔，我不知……一次或兩次吧……導師：哦……你是怎麼練習的？學生：我不知道。我只是埋頭彈！簡單地講，這就是天真的練習：只是埋頭幹！我剛剛揮起球拍，努力去擊球。我剛剛聽到了那些數字，想辦法去記住。我剛剛看到了那些數學題，正試著解答。有目的的練習"
        },
        {
          "title": "有目的的練習的四個特點",
          "content": "有目的的練習具有定義明確的特定目標我們假想的音樂學生如果確定了類似下面這樣的練習目標，可能會比他漫無目的的練習要成功得多：“連續三次，不犯任何錯誤，以適當的速度彈奏完曲子。”如果不制訂這樣一個目標，就沒有辦法判斷練習是不是成功了。在史蒂夫·法隆的案例中，我們並沒有制訂長遠目標，因為我們都不知道他可能記得住多少個數字，但他有一個極具針對性的短期目標：每次都比上一次多記住一個數字。他好比一位極具競爭力的長跑選手，而且，他把長跑的態度帶到了實驗之中，即使他只是在和自己競爭。從一開始，史蒂夫就逼著自己每天都增加一個數字，使自己能夠記住。有目的的練習，主要是“積小勝為大勝”“積跬步以至千里”，最終達到長期目標。如果你平常週末都去打一打高爾夫球，而你想將你的差點[1]降低至5杆，那麼，這對總體目標十分有益，但還不是一個定義明確的具體目標。定義明確的具體目標，可以有效地用於引導你的練習。要把目標分解，並制訂一個計劃：為了將差點降至5杆，你得做些什麼？其中的一個目標可能是增加把球打入平坦球道的次數。這是一個合理的具體目標，但你甚至還得將它進一步分解：為了成功地把球打入平坦球道，你到底要做些什麼？你得搞懂，為什麼你有那麼多次沒能把球打到平坦的球道上去，並且解決這個問題，比如說，想辦法糾正你總是勾球的毛病。怎麼做到？可以請一位教練來教你怎樣以特定方式改一改你的揮拍動作。諸如此類。關鍵是接受那個一般目標（並且日漸精進），並將其轉化成一些具體目標，使你能達到切合實際的進步的期望。有目的的練習是專注的史蒂夫·法隆不同於奧爾描述的那位音樂學生，而是一開始就非常專注於他的任務，隨著實驗的一步步進行，記住越來越長的數字串，他的注意力也更集中。你可以聽一聽他在第115次訓練時的錄音帶，就可以對他的專注有所感受。第115次練習恰逢我們的實驗進行到一半。當時，史蒂夫一般能夠記住接近40個數字的數字串了，但還不能穩定地記住40個數字，而他真的很想在這一天做到。我們首先從35個數字開始，那對他來說已經很容易了，於是，他開始迫使自己增加數字串的長度。在我讀出39個數字的數字串時，他對自己說了一句鼓舞士氣的話，聽起來跟他正接近完成的任務沒有什麼關係。他說：“我們今天在這裡完成突破！……我不會錯過這次突破的機會，不是嗎？當然不會……這將是轉折的時候！”我花了40秒讀出那些數字，他一直保持沉默，但那時，隨著他仔細在腦海中回顧那些數字，記住它們不同的分組以及出現的不同順序，他幾乎控制不住自己了。好幾次，他大聲地拍著桌子，還經常拍手，顯然是在慶祝他記得這一組或那一組數字，或者記得它們在數字串中處在什麼位置。他一度大聲喊出來：“絕對正確！我很確定！”當他說出最後一個數字時，回頭看我。我告訴他說，他真的背出來了。於是，我們接下來開始背40個數字。這一次，他又開始自言自語：“這次，大任務來了！如果我過了這一關，就全都結束了！我必須過了這個關卡。”在我讀數字的時候，他再度保持沉默，接著，輪到他背誦時，他又發出興奮的嘈雜聲，並且在他想出來之後，大聲地歡呼：“哇……來吧！……好的！……繼續！”他又一次背出來了，事實上，這一次的練習已經成為他能夠經常背出40個數字的練習了，儘管他再背不了更多。如今，並非每個人都通過高聲叫喊和拍桌子的方式集中注意力，但史蒂夫的表現說明了我們可以從有效練習的研究中獲得一條重要洞見：要想取得進步，必須完全把注意力集中在你的任務上。有目的的練習包含反饋你必須知道某件事情自己做得對不對，如果不對，你到底怎麼錯了。在奧爾的例子中，音樂學生在學校的表演測試上得了個C，這是一種遲到的反饋，但他在練習時，似乎沒有人給他提供任何反饋，也就是說，沒有人聽他練習並指出他的錯誤，而這位學生看起來根本不知道他的練習是不是出了錯。（“你有多少次正確地彈奏了曲子？”“唔，我不知道……一次或兩次吧……”）在我們的記憶研究中，每次嘗試之後，史蒂夫便會得到簡單而直接的反饋，如對還是錯，成功還是失敗。他總是知道自己的位置。但最為重要的反饋，也許是他自己給自己提出的。他密切關注那些他記不住的數字串。如果把這樣的數字串背錯了，他通常知道到底是什麼原因，以及他漏背了哪些數字。即使最後他終於背出來了，他事後也會告訴我，哪些數字讓他感到難以記住，以及哪些數字完全沒問題。他意識到了自己的弱點在哪裡，便可以適當地轉變他的關注焦點，並提出新的記憶方法來彌補那些弱點。一般而言，不論你在努力做什麼事情，都需要反饋來準確辨別你在哪些方面還有不足，以及怎麼會存在這些不足。如果沒有反饋（要麼是你自己給自己提出的，要麼是局外人給你提出的），你不可能搞清楚你在哪些方面還需提高，或者你現在離實現你的目標有多遠。有目的的練習需要走出舒適區這也許是有目的的練習最為重要的一個組成部分。奧爾的音樂學生並沒有逼迫自己走出熟悉和舒適的區間。相反，學生的話似乎表明，他在練習中，只是毫無條理地進行了一些嘗試，並沒有努力去迎接新的挑戰，僅僅是做那些他已經感到很容易的事情。而這種方法是不管用的。我們的記憶實驗在設計之初就避免讓史蒂夫感到太舒服。隨著他增強自己的記憶能力，我會用更長的數字串來挑戰他，以便他總是能在離自己的能力極限不遠的地方發揮出自身的能力。特別是，每次他背出來了，我便增加數字的數目；他沒背出來，我便減少數字的數目。這樣一來，我把數字的數目恰好保持在他能夠背得下來的程度，同時也總在促使他記住只比之前多一個數字的數字串。對於任何型別的練習，這是一條基本的真理：如果你從來不迫使自己走出舒適區，便永遠無法進步。比如，業餘鋼琴愛好者在十幾歲的時候就開始上鋼琴課，等到30年過去了，他還在以完全相同的方式彈奏著那些同樣的歌曲，看起來，在那段時間裡，他已經積累了數十萬個小時的“練習”，但他絕不會比30年前彈得更好。事實上，可能還比年輕時彈得更差。同樣，這種現象放在醫學上，也是這個道理，而且，我們有特別有說服力的證據。研究界對許多專家進行過研究，結果發現，已訓練三四十年之久的醫生，在一些客觀績效指標的測量上，比那些剛從醫學院畢業兩三年的醫生更差一些。這表明，那些醫生中的大多數在他們的日常練習中並沒有精進自己的業務，或者也沒能保住他們的能力；他們沒有給自己設定太大的挑戰，或者沒有將自己推出舒適區。出於這一原因，我在2015年參加一個共識大會時，辨別了一些醫學繼續教育的新型別，這些教育將給醫生出難題，並幫助他們保持和精進他們的技能。我們將在第5章詳細探討這一話題。關於這一點，我最喜歡的例子也許是本傑明·富蘭克林的國際象棋棋藝。富蘭克林是美國第一位著名的天才。他是一位科學家，因其對電的研究而名聲遠揚；又是一位受歡迎的作家和出版家，出版了《窮理查智慧書》（Poor Richard抯Almanack）；還是美國第一家公共借閱圖書館的創始人、卓有成就的外交家、發明家等，我們還知道跟他有關的事物是雙焦眼鏡、避雷針和富蘭克林火爐。但他最痴迷的是國際象棋。他是美國第一位國際象棋棋手，曾參加過最早的國際象棋比賽，並在那裡廣為人知。他下了30年國際象棋，老了的時候，他把更多的時間花在下棋上。他在歐洲的時候，和當時最著名的棋手下過棋。儘管他曾給大家提過“早睡早起”的建議，但他自己下起國際象棋來，往往下到早上6點，直到太陽升起。因此，本傑明·富蘭克林那麼聰明，而且又花了數千個小時來下棋，有時候還和當時最佳的棋手過過招。他是不是讓自己成了最偉大的國際象棋棋手？沒有。他的水平只能說是中上等，從來沒有強大到能與歐洲優秀棋手相提並論的地步，更別說最優秀了。在國際象棋上的失敗，令他感到異常氣餒，但他從不知道，為什麼自己的棋藝無法精進了。如今我們都明白了其中的原因，那便是：他從來沒有逼一逼自己，從來沒有走出過舒適區，也從來沒有進行數小時的刻意練習，而那種練習正是提高棋藝所需要的。他就如同一名在30年的時間裡一直以同樣的方式彈同樣一些曲子的鋼琴家。這種做法，是使自己停滯不前的“訣竅”，而不是使自己技藝精進的祕訣。[1] 指高爾夫運動中給弱者增加的杆數。——譯者注"
        },
        {
          "title": "遇到瓶頸怎麼辦",
          "content": "走出舒適區，意味著要試著做一些你以前沒做過的事情。有時候，你也許發現，做一些沒做過的事情，相對較為容易，然後你會繼續逼迫自己。但有時候，你偶然碰到了那些讓你感到很難做好的事情，似乎你永遠也做不了。想辦法去逾越這些障礙，是通向有目的的練習的隱藏鑰匙。試著做不同的事情，而非更難的事情通常情況下，這種解決方案並不是“試著做更難的事情”，而是“試著做不同的事情”。換句話講，這是一個方法問題。在史蒂夫的案例中，當他背誦到22個數字時，碰到了一個障礙。結果，他把它們分為四個組，每組四個數字，運用各種不同的記憶竅門來記住這些數字組，然後再加上一個包含6個數字的排練組，放在最後，以便他可以一遍又一遍地重複，直至能借助數字的聲音來記住這個組。但他沒能搞懂怎樣記住這22個數字，因為當他在腦海中把它們按一共五個組、每組四個數字來排列的時候，他對數字的順序有些混淆。最後，他突然想到一個主意：同時使用三個數字一組和四個數字一組的兩種組合，這樣一來，他終於取得了突破，使自己運用了四個數字組、每組四個數字，以及四個數字組、每組三個數字、再加個六個數字的排練組，最多記到了34個數字。然後，一旦他達到那一極限，就必須再想其他辦法了。這就是史蒂夫在我們的整個記憶研究中一種常規的模式：首先取得進步，然後到了一個瓶頸，被困住了，尋找不同的方法來克服障礙，最後找到了這種方法，然後又穩定地提高，直到下一個障礙出現。不管什麼障礙，越過它的最好辦法是從不同方向去想辦法，這也是這種方法需要導師或教練的一個原因。有些人已經熟悉了你可能遇到的障礙，於是，可以為你提供克服障礙的方法。事實證明，有時候，其實更多的是心理層面的障礙。著名小提琴導師多蘿茜·迪蕾（Dorothy DeLay）曾描述過，有一次，她的一位學生前來找她，請她幫他加快在某首曲子上的演奏速度。原來，根據時間安排，他要在一個音樂節上演奏該曲。學生對多蘿茜說，他演奏得不夠快。多蘿茜問他，到底演奏得多快？他回答說，他想和世界著名小提琴家伊扎克·帕爾曼（Itzhak Perlman）一樣快。於是，迪蕾首先錄下了帕爾曼演奏的那首曲子，並記下了時間。然後，她設定了一個節拍器，以減慢速度，讓她的學生根據減慢的速度來演奏，這當然在學生的能力範圍之內。她讓他一遍遍地演奏，每次都稍稍加快一點節奏。於是，學生每次都能演奏好。到最後，等到學生可以分毫不差地演奏這首曲子後，多蘿茜告訴學生：他實際已經演奏得比伊扎克·帕爾曼更快了。比爾·蔡斯和我兩人對史蒂夫採用了好幾次相似的方法，當時，史蒂夫遇到了一個障礙，認為他可能無法進一步提高自己的記憶力了。我一度稍稍放慢了讀數字的速度，使得史蒂夫有更多時間來記住明顯多得多的數字。這讓他確信，問題並不在於那些需要他記住的數字有多少，而在於他能多麼迅速地將數字編碼到記憶中去，也就是為構成整個數字串的各組不同的數字找到記憶術，如果他可以加快速度將數字放到長時記憶中去，那麼，他就有可能提高自己的表現。另一次，我給史蒂夫的數字串，比起他在那個時刻能夠記住的數字串長了10個數字。結果，他記住了那些數字串中更多的數字，連他自己也感到吃驚。特別是，儘管記得並不太完美，但他記住的數字總數，已經打破了此前的記錄。這讓他確信，事實上他完全有可能記住數字更多的數字串。他意識到，他的問題並不是自己已經抵達了記憶力的極限，而是他在整個數字串中漏掉了一組或兩組數字。他認定，繼續前進的關鍵是更加仔細地將數字的小組進行編碼，於是，他又開始提高自己的水平了。並非達到極限，而是動機不足不論什麼時候，只要你在努力提高自己在某件事上的水平，都會偶然碰到那些障礙，也就是說，在某些時刻，似乎你不可能再取得任何進步了，或者，至少你根本不知道自己該做些什麼才能提高水平。這是自然而然的。不自然的是那種真正讓你完全停下腳步的障礙，那種不可能逾越的障礙。在我多年的研究中，並沒有找到任何清晰的證據來證明，在任何行業或領域，人們真的會遇到績效和表現完全不變的極限。相反，我發現，人們通常會在努力提高自己的時候放棄並停下。這裡有一條注意事項：儘管我們總能繼續前進和不斷進步，但要想做到，並不見得總是輕而易舉。保持專注並繼續努力，是很難做到的，而且通常沒有趣味。因此，動機的問題不可避免地浮現出來：為什麼有些人願意進行這種練習呢？是什麼使他們繼續下去呢？我們將在本書中一次又一次地回顧這個至關重要的問題。在史蒂夫的案例中，有幾個因素在發揮作用。首先，他是有報酬的。不過，他本來可以總是參加我們的練習，卻在記住數字時不做格外的努力，依然能拿到他的報酬，因此，儘管獲取我們支付的報酬，是他的一部分動機，卻一定不是全部的動機。那麼，為什麼他要如此狠逼自己進步呢？我和他交談過，我認為，他的動機更大程度上因為在開始了前幾次練習之後，他開始看到自己的進步，而他確實樂於見到自己的記憶力得到強化。這種感覺很好，他希望一直有那種感覺。此外，在他的記憶能力達到了一定水平之後，他某種程度上成了名人；關於他的故事開始出現在報紙和雜誌上，他還在許多電視節目中亮相，包括《今日秀》（Today）節目。這為史蒂夫提供了另一種正面反饋。一般來講，有意義的正面反饋是保持動機的關鍵要素之一。這種反饋可能是內部反饋，比如滿足於看到你自己在某件事上的水平提高，也可能是由其他人提出的外部反饋，但它們對某個人是否能夠在有目的的練習過程中堅持不懈地努力以提高自己的水平十分重要。另一個因素是：史蒂夫樂於挑戰自己。從他以前參加過越野賽跑，而且是田徑賽場上的活躍參與者，便可明顯看出。所有認識他的人都會告訴你，他只要一參加訓練，就會和別人一樣刻苦，但他的這種動機，只是為了提高自己的表現，並不一定是為了贏得比賽。此外，他從自己多年的奔跑經歷中瞭解到，定期的訓練，一週接一週、一月接一月的訓練意味著可以有效地提高表現，而且，對他來說，每週三次、每次只進行一小時訓練，也不是一件格外艱難的任務，因為他經常參加長達三小時的跑步。後來，在結束了與史蒂夫和其他一些學生的記憶研究之後，我只招聘一類研究物件：運動員、舞蹈家、音樂家或歌手等曾接受過大量培訓的人。他們中沒有人中途退出實驗。因此，我們在這裡簡單地總結有目的的練習：走出你的舒適區，但要以專注的方式制訂明確的目標，為達到那些目標制訂一個計劃，並且想出監測你的進步的方法。哦，還要想辦法保持你的動機。對想要提高自己的每個人來講，這些是讓你有一個卓越開端的祕訣——但依然只是開始。"
        },
        {
          "title": "有目的的練習還不夠",
          "content": "儘管比爾·蔡斯和我依然與史蒂夫·法隆一起進行著我們為期兩年的記憶研究，但在史蒂夫決定用他那得到了強化的記憶去從事別的事業時，我們決定尋找另一位樂於接受相同挑戰的研究物件。我們不相信史蒂夫天生就是具備能夠記住數字的天賦，而是假定他提升的這些技能，完全歸功於他經歷過的這些培訓，而最佳的證明方法是與其他的研究物件一起，再進行同樣的研究，看一看我們是否能獲得同樣的結果。第一個自願參與研究的是一位研究生，名叫雷妮·艾里奧（Renée Elio）。在開始前，我們告訴她，她之前的那位研究物件能夠記住的數字的數量大幅度增加了，因此，她知道，那樣的進步是可能的。這樣一來，她比史蒂夫剛開始參與實驗時，知道的東西更多一些。不過，我們沒有向雷妮透露半點史蒂夫的表現。她必須想出自己的辦法來記憶。她開始練習時，進步的速度與史蒂夫非常接近，在進行了50個小時左右的練習後，她也強化了自己的記憶，能夠記得住接近20個數字。不過，和史蒂夫不同的是，到這個時候，雷妮好比碰到了一堵無法逾越的牆。後來，她又花了50個小時左右的時間，沒有取得任何進展，因此決定退出培訓。她將自己記數字的記憶能力強化到了遠比任何未經訓練的人強大的地步，並且能夠與某些記憶術專家媲美，但她感覺與史蒂夫取得的進步相比，還有很大的差距。差距在哪裡差距在哪裡？史蒂夫成功地構建了一系列的心理結構，使自己能夠使用長時記憶來回避短時記憶通常的侷限，並且記住長串的數字。那種心理結構，也就是各種各樣的記憶術（許多的這些記憶術，以執行的時間為基礎，再加上一個用於追蹤記憶術次序的體系）。例如，當史蒂夫聽到數字907時，他將它們想象成很好記的概念，9：07，或者說9分7秒，這些便不再是必須用短時記憶來記住的隨機數字了，而是他已經熟悉的概念。正如我們將會看到的那樣，改進幾乎各種型別的心理表現，至關重要的是心理結構的構建，這樣便可以避免短時記憶的侷限，並且馬上就能高效地處理大量資訊。史蒂夫做到了這一點。而雷妮並不知道史蒂夫是怎麼做到這樣的，於是採用了完全不同的方法來記數字。史蒂夫主要基於執行的時間，將數字分成三個和四個一組。他記住了那些組的時候，雷妮卻採用一系列深思熟慮的記憶術，它們得依靠天數、日期和一天中的時間，等等。史蒂夫和雷妮之間的重要差別在於，史蒂夫總是在記住數字之前，事先決定採用什麼模式來記憶，將數字串分解成三個或四個數字的數字集，到最後再加上一個由4~6個數字組成的數字串，然後，他把最後那個數字串一遍一遍對自己重複，直到他能在記憶中記住它的聲音了。例如，對於27個數字的數字串，他會把數字整理到三個組中，每組四個數字，然後再整理到三個組中，每組三個數字，最後留一個由六個數字組成的組。我們把這種預先固定的模式稱為“檢索結構”（retrieval structure），它使得史蒂夫可以著重記住三個數字和四個數字的數字組，一組一組地記，然後在腦海中記住這些單個的組適合放在檢索結構中的哪個位置。事實證明，這是一種強大的方法，因為它使得史蒂夫能將每組數字（由三個數字或四個數字組成）作為執行時間或其他記憶術加以編碼，放入其長時記憶中，然後，他不必再去想它們了，而是直到他最後回憶數字串中所有數字時才再度回顧。相反，雷妮設計的記憶術是：根據她聽到的數字是什麼，再決定使用什麼方法來記住它們。例如，對於4778245這一串數字，她可能把它記成是1978年4月7日2點45分，但如果數字串變成了4778295，她必須採用1978年4月7日的方法，然後加上一個新的日期：2月9日……由於這種方法不具備史蒂夫採用方法的那種一致性，因此，她沒法記住超過20位數字。建立檢索結構比爾和我有了那次經驗後，決定再找一位研究物件，要求他儘可能採用與史蒂夫相似的方法來記住數字串。因此，我們招聘了另一位跑步者，名叫達里奧·多納泰利（Dario Donatelli）。達里奧是卡內基梅隆大學長跑隊的一名成員，也是史蒂夫的訓練夥伴。史蒂夫告訴達里奧，比爾和我正在尋找一位研究物件，要求該物件能夠長期參與記憶訓練的研究，達里奧同意了。這一次，我們沒有讓達里奧自己去思考怎樣記這些數字，而是讓史蒂夫把他的方法教給達里奧。有了這個開始，達里奧的進步速度比史蒂夫快得多，至少是剛開始時快得多。他經歷的訓練次數明顯比史蒂夫少得多，便能記住20個數字了，但從那以後，他的速度開始放緩，一度達到了能記住30個數字的水平，但似乎史蒂夫的方法對他沒有太大的好處了，而且，他的進步開始消失。這時，達里奧開始琢磨著改編史蒂夫的方法。他提出稍稍不同的方法來編碼三個和四個數字的數字組，更為重要的是，他設計了一個明顯不同且非常適合他的檢索結構。儘管如此，當我們測試達里奧怎樣記那些數字時，發現他在依靠一些心理過程，它們與史蒂夫開發的心理過程十分相似，運用長時記憶來避開短時記憶的侷限。經過幾年的訓練，達里奧最終能記住100多個數字組織的數字串，或者說，大約比史蒂夫多記了20個數字。此刻，和之前的史蒂夫一樣，達里奧變成了這個世界上這種特殊技能最優秀的擁有者，一下子聲名遠揚。這裡有一條重要的經驗：儘管我們通過專注的訓練和走出舒適區，一般能在某種程度上提高自己做某件事的能力，但那並不是全部。刻苦努力還不夠。逼迫自己超越極限，也不夠。人們通常忽略了訓練與練習中的其他一些同等重要的方面。學術界對一種特定的練習與訓練方法進行了研究，該方法已被證明是提高人們在各個行業或領域中的能力的最強大和最有效的方式。這種方法就是“刻意練習”，我們會馬上進行詳盡描述。但首先讓我們更加密切地觀察，在這種令人稱奇的改進背後，到底有著怎樣的原因。"
        }
      ]
    },
    {
      "chapter": "第2章",
      "title": "大腦的適應能力",
      "content": "",
      "sections": [{
          "title": "倫敦計程車司機的大腦",
          "content": ""
        },
        {
          "title": "大腦擁有無限的適應能力",
          "content": ""
        },
        {
          "title": "走出舒適區的重要性",
          "content": ""
        },
        {
          "title": "練習改變大腦結構",
          "content": ""
        },
        {
          "title": "潛能可以被構築",
          "content": ""
        }
      ]
    },
    {
      "chapter": "第3章",
      "title": "心理表徵",
      "content": "",
      "sections": [{
          "title": "偶然的盲棋大師",
          "content": ""
        },
        {
          "title": "大師比新手強在哪裡",
          "content": ""
        },
        {
          "title": "心理表徵是什麼",
          "content": ""
        },
        {
          "title": "心理表徵有助於找出規律",
          "content": ""
        },
        {
          "title": "心理表徵有助於解釋資訊",
          "content": ""
        },
        {
          "title": "心理表徵有助於組織資訊",
          "content": ""
        },
        {
          "title": "心理表徵有助於制訂計劃",
          "content": ""
        },
        {
          "title": "心理表徵有助於高效學習",
          "content": ""
        }
      ]
    }
  ]
}