{
  "天才存在嗎": "為什麼有些人對他們所做的事情如此擅長，擅長到令人不可思議的地步？不論你觀察哪個行業或領域，從競技體育、音樂表演，到科學界、醫學界和商業界，似乎總有幾個非同凡響的人，讓我們對他們能做的事情以及傑出的程度感到炫目。當我們遇到一個如此非同凡響的人時，往往自然而然地認為，這個人生來就比別人優秀。我們經常說，“他真的很有天賦”，或者“她是真正的天才”。但現實的確如此嗎？對這些在其各自行業或領域表現優異的人，比如運動員、音樂家、棋手、醫生、商人、教師，等等，我研究了30多年。我深入細緻地研究了他們的許多細節，包括他們所做的事情，以及怎樣做事情。我暗中觀察他們、採訪他們，而且測試他們。我探索了這些傑出人物的心理狀態、生理機能以及神經解剖學部分。隨著時間的推移，我漸漸懂得，沒錯，這些人的確有著卓越的天才，它們深藏於他們的能力之中。但是，他們的天才，並非人們通常假定的那種，而且，甚至比我們想象的還要強大。最重要的是，這是一種我們每個人都與生俱來的才能，通過適當的方法，我們也一樣可以充分利用。",
  "莫扎特的完美音高": "1763年，年輕的沃爾夫岡·阿瑪多伊斯·莫扎特計劃環歐洲旅行演出。正是這次演出，鑄就了他的傳奇。那一年，莫扎特僅僅7歲，身材矮小得只能勉強看到大鍵琴的頂部，但他用自己演奏小提琴及各種鍵盤樂器的技能，深深地迷住了家鄉薩爾茲堡的觀眾。他演奏的樂器，看上去讓人不敢相信，如此小的孩子居然能演奏。但莫扎特還留有另外一手，甚至讓他那個時代的人更加感到震驚。我們知道他的這種更令人震驚的天才，是因為在莫扎特及其家人離開薩爾茲堡開始旅行演出之前不久，莫扎特父親的故鄉奧格斯堡的報紙上發表了一封寫給編輯的信，信中談到了年幼的莫扎特。信的作者寫道，年幼的莫扎特聽到某種樂器演奏出來的調子時，不論是哪種調子，馬上便能準確地辨別出來：是高於中央C音的第二個八度音的升A調，還是低於中央C音的降E調。莫扎特甚至能在某個房間裡聽得出另一間房間裡的人彈奏的調子，而且，他不但能分辨小提琴和古鋼琴演奏出來的調子，還能分辨任何一種樂器的調子。莫扎特的父親是一位作曲家，也是一位音樂教師。他的家裡擺滿了各種各樣的樂器，只要是大家可以想象到的，幾乎應有盡有，而且不僅僅是樂器。莫扎特這個小孩，還可以分辨任何足夠像音樂的聲音的調子，比如時鐘的報時、大鐘的鳴響，以及人們打噴嚏的聲響。在當時，大多數已成年的音樂家，即使是經驗最豐富的，也無法與莫扎特匹敵。他在這方面的奇才，甚至比起他在鋼琴和小提琴上的才華，更能表現出他天生就有的那些神奇才能。當然，如果放在今天，這種能力並非如此高深莫測。比起250年前，今天的我們，不但知道的東西更多，而且大多數人，至少都聽過那些音調。在音樂上，“絕對音高”（absolute pitch）是個技術術語[更多的人稱之為“完美音高”（perfect pitch）]。它異常罕見，大約在每萬人中，只有1個人具備這種能力。這種能力在世界級的音樂家之中，比在我們普通人之中更加罕見，甚至在樂器演奏名家中，也非同尋常：人們認為，這種能力，貝多芬有，勃拉姆斯卻沒有；弗拉基米爾·霍洛維茨有，伊戈爾·斯特拉文斯基卻沒有；弗蘭克·辛納屈有，邁爾斯·戴維斯卻沒有。簡而言之，這似乎是一個絕好的例子，證明某種與生俱來的天賦，往往只有少數一些幸運的人才會天生擁有，其他大多數人並不具備。事實上，至少在200多年的時間裡，人們普遍是這麼認為的。但在過去的幾十年裡，人們對完美音高的理解，出現了極大的差異。如今，人們對完美音高的理解，直指我們人類另一種不同的才華，而不是純粹音樂方面的才華",
  "“天才”是訓練的產物": "只是在最近，神經系統科學家才開始懂得，為什麼存在那樣的才華。數十年來，科學家相信，我們的大腦天生就帶有一些極其固定的迴路，而這些迴路決定了我們的能力。你的大腦，要麼對完美音高十分適應，要麼不適應，而且，你沒有太多的辦法去改變它。你可能需要一定程度的訓練，將那種天生的才華充分提升，而且，如果沒有獲得這樣的練習，你的完美音高也許不會得到充分的發揮，但人們一般認為，如果你天生就不具備適當的基因的話，練得再多，也無濟於事。但是，自20世紀90年代以來，研究大腦的研究人員開始意識到，大腦（甚至是成年人的大腦）比我們想象的具有更強的適應能力，這使得我們可以在很大程度上控制大腦能做的事情。特別是，大腦採用以各種方法“重新佈線”的方式，對適當的觸發因子做出響應。神經元之間構成了新的連線，同時，現有的連線要麼得到強化，要麼被弱化，在大腦的某些部分之中，甚至還可能生長新的神經元。這種適應能力，解釋了榊原彩子的研究物件以及莫扎特怎樣培育和提升完美音高：他們的大腦通過發展特定的、能夠擁有完美音高的迴路，對音樂訓練做出響應。迄今為止，我們尚不能辨別那些迴路都是些什麼迴路，也不能說它們看起來是什麼樣子，或者它們到底在做些什麼，但我們知道，它們一定在那裡，而且知道，它們是訓練的產物，並不是某些天生的基因。在完美音高的案例中，當孩子過了6歲以後，大腦的必要的適應能力就會消失，因此，如果完美音高必備的重新佈線還沒有出現的話，那麼，它將永遠消失。（不過，正如我們將在第8章描述的那樣，也有一些例外的情況，讓我們能夠深入瞭解人們如何充分地利用大腦的適應能力）。這種消失，是一種更寬廣現象中的一部分，也就是說，年輕人的大腦和身體的適應能力比成年人更強，因此，有些能力只能在6歲、12歲或18歲之前培養，或者在這些年齡之前更容易培養。儘管如此，在我們整個成年時期，身體和大腦依然都保留著極大的適應能力，這種適應能力，使得成年人甚至老年人也可能通過正確的訓練，培養各種新的能力。天才更懂得利用大腦的適應能力牢記這一點，讓我們回到我在開篇時提出的問題：為什麼有些人對他們所做的事情如此擅長，擅長到令人不可思議的地步？我在對各個不同行業或領域的專家進行的多年研究中發現，他們全都以和榊原彩子的學生同樣的方式培養了自己的能力，也就是說，通過專注的訓練促使大腦改變（有時候根據人們的能力不同，還可以促使身體上的改變），那些改變使得他們能夠做到在正常情況下可能做不到的事情。沒錯，在某些案例中，基因遺傳確實也很重要，特別是在身高或其他生理因素十分重要的領域或行業。比如，某位男性的身高基因為165釐米左右，那麼，他可能發現自己很難成為一位職業籃球運動員；同樣，一位身高接近183釐米的女性，將會發現自己事實上不可能成為一名具有較高水準的藝術體操運動員。同時，如我們將在本書後面的內容中討論的那樣，基因可能還以許多其他的方式影響著某人的成就，特別是那些影響著某人有多大的可能勤奮並正確地練習的基因。但從數十年的研究中發出的清晰訊號是：不論基因遺傳可能在“天才”取得的成就中發揮著什麼作用，這些人擁有的重要才華，與我們每個人都擁有的才華是一樣的。也就是說，他們和我們一樣，大腦和身體都具有適應能力，只是比我們更多地利用了那一能力而已。如果和那些傑出人物交談一番，你會發現，他們全都在某種程度上理解這一點。他們也許對認知適應的概念不太熟悉，但很少接受這樣的觀點：他們在自己行業或領域中達到巔峰，是因為他們遺傳了優秀的基因。他們知道，培養卓越的技能，是因為他們首先就具有了那些方面的豐富經驗。在這個主題上，我最喜歡的證據是曾十次入選NBA全明星陣容、聯盟歷史上最偉大三分射手的雷·阿倫（Ray Allen）。多年前，ESPN評論員傑奇·麥克馬蘭（Jackie MacMullan）曾寫過一篇關於雷·阿倫的文章，那時，後者即將創造三分籃的歷史紀錄。在說到雷·阿倫的故事時，麥克馬蘭提道，另一位籃球評論員曾說，雷·阿倫天生就是三分王。換句話講，他具有三分射手的天賦。但雷·阿倫並不贊同這種說法。他告訴麥克馬蘭，“我和身邊的許多人圍繞這個話題爭論過。當人們說，上帝賜予我傑出的稟賦，讓我在比賽中完成漂亮的三分跳投時，那真是氣死我了。我告訴這些人，‘不要低估我每天付出的巨大努力。’不是一天兩天，是每一天。問一問我曾經的隊友，哪個人在訓練投籃的時候最為刻苦。回到西雅圖和密爾沃基，問一問那些球員們。他們的回答一定是我。”事實上，正如麥克馬蘭說過的那樣，如果問過雷·阿倫高中籃球隊的教練，你會發現，雷·阿倫在高中時代的跳投，並不比其他隊友更出色；事實上，他的表現還很差。但他不向命運低頭，而是掌控著自己的命運，一直在心無旁騖地刻苦訓練。隨著時間的推移，他將自己的三分跳投訓練得如此嫻熟自然，動作優美，以至於人們以為他天生就是個傑出的三分射手。他只是利用了他的天才，他真正的天才。",
  "本書將告訴我們什麼": "本書描述莫扎特、榊原彩子的研究物件以及雷·阿倫等人共同擁有的才華，也就是說：通過正確的訓練與練習進行創造的能力。這種能力與才華，只有通過利用人類的大腦與身體不可思議的適應能力，才可能擁有。此外，本書還闡述了這樣一個觀點：為了提高人們在選擇的行業或領域中的表現和水平，每一個人能以怎樣的方式將其才能發揮出來。最後，本書最廣泛的意義在於，它介紹了一種關於人類潛力的新思考方式，提醒著我們：我們擁有更大的力量來掌控自己的人生，但我們以前卻從來沒有意識到。自遠古時代開始，人們通常以為，某個人在任何特定行業或領域內的潛力，不可避免地受到天生才能的限制。上鋼琴課的人很多，但只有那些有著特殊天才的人們才可能成長為真正偉大的鋼琴家或作曲家。每個孩子在學校裡都上數學課，但只有少數一些人長大後能成為數學家、物理學家或工程師。根據這種觀點，我們每個人一生下來，都具有一些固定的潛力，有的具有音樂潛力，有的在數學方面有天賦，有的生來就適合體育運動，有的天生精於商道，我們可以選擇發展（或者不發展）那些潛力中的任何一種，但不可能填補那些特定的“缺陷”。因此，教育或訓練的目的變成了幫助人們發揮他的潛力，以便儘可能充分地填補那些缺陷。這意味著，可以採用一種特定的方法來進行那種假設了預定極限的學習。但我們現在知道，這種預先確定的能力並不存在。大腦是可適應的，而訓練可以創造一些我們以前並未擁有的技能（比如完美音高）。這是具有顛覆意義的觀點，因為如今的學習變成了一種創造能力的方式，而不是使人們能學會充分利用他們的內在才華。在這個全新的世界，認為人們天生就具有一些固定潛力的觀點已經站不住腳了；相反，潛力好比可延伸的血管，能夠通過我們一生中經歷的各種各樣的事情來創造。學習不再是挖掘某人潛力的方式，而是發展這種潛力的方式。我們可以創造自己的潛力。無論我們的目的是成為鋼琴家，或者只求自娛自樂，能彈得一手漂亮的鋼琴，是加入美國職業高爾夫巡迴賽，或者只為了能打幾個好球，都是這麼回事。那麼問題來了：我們怎麼做到？我們怎麼充分利用這種才華，並在我們選擇的行業或領域中塑造我們的能力？過去幾十年間，我的大部分研究一直致力於回答這個問題，也就是說，致力於辨別和理解提高我們在某種特定活動中表現和水平的最佳方法。簡單地講，我一直在問，哪些方法管用？哪些方法不管用？為什麼？令人震驚的是，絕大多數曾圍繞這個普遍主題著書立說或者發表評論的人，幾乎沒有關注過這個問題。過去幾年裡，許多作者在他們寫的書中認為，我們一直過於高估了天生才能的作用，低估了諸如機會、動機和努力的價值。我十分同意這種觀點，而且，讓人們知道他們可以通過練習來提高，並且大幅度地提高，一定十分重要。否則，他們可能連試一下的動機都沒有。但有些時候，這些書籍給人們留下的印象是：光靠真誠的願望與刻苦的努力，就足以提高了，“只要你努力朝前奮進，終將達到目標”。但這也是錯誤的。在足夠長的時間內進行正確練習，可以實現改進。再無其他。本書詳細地描述了“正確的練習”是什麼，以及可以怎樣發揮它的作用。我們從一個相對較新的心理學領域中找到了涉及這種練習的細節，最好是將這個領域描述為“專業特長科學”。這個新的領域著眼於理解“傑出人物”的能力，所謂“傑出人物”，就是那些在他們所從事的行業或領域中表現最突出的人們，以及那些登上了巔峰的人們。同時，我還發表了關於這一主題的幾本學術專著，包括1991年出版的《從平庸到卓越：前景與侷限》（Toward aGeneral Theory of Expertise：Prospects and Limits），1996年的《通向卓越之路》（The Road to Excellence），以及2006年的《劍橋專業特長與傑出表現指南》（The Cambridge Handbook of Expertise and Expert Performance）等。我們中那些在這一專業領域（指前面提到的“專業特長科學”的領域）從事研究的人，調查了是什麼因素使這些傑出人物從其他人中脫穎而出。我們還嘗試著逐步研究這些專家級的傑出人物如何隨著時間的推移而提高他們的表現和水平，以及他們在提高的時候，其心理和生理能力出現了怎樣的改變。20多年前，在研究了一系列行業或領域中的專家級人物之後，我的同事和我開始意識到，不論在什麼行業或領域，提高表現與水平的最有效方法，全都遵循一系列普遍原則。我們把這種通用的方法命名為“刻意練習”（deliberate practice）。如今，對於在任何一個行業或領域中，希望充分利用人們的適應能力這種才能來學習新的技能與能力的所有人來講，刻意練習依然是黃金標準，而且，它是本書的核心內容。本書的前半部分描述了刻意練習是什麼，為什麼管用，以及傑出人物如何運用它來發展傑出的能力。為了做好這些，我們必須研究各種不同型別的練習，從最簡單的到最複雜的，並探索它們之間的差別。不同型別的練習的關鍵差別在於，它們對人類的大腦和身體的適應能力的利用程度各不相同，因此，我們將花一些時間來探討那種適應能力，以及是什麼觸發了那種能力。我們還探究，到底我們的大腦發生了哪種變化來響應刻意練習。獲取專業特長，很大程度上是改進人們的心理過程（在某些行業或領域中，還包括改進那些控制著身體運動的心理過程），而且，人們已經很好地理解了身體功能的變化（比如力量增大、柔韌性增強、耐力增強等），因此，本書著重闡述傑出人物的心理層面，儘管在體育專案以及其他運動專案之中，人們專業特長的提升一定有著明顯的體能要素。在進行了這些探索之後，我們將研究，所有這些要素是如何在傑出人物的身上融合到一起的。這種融合是個漫長的過程，通常需要10年之久，甚至更長的時間。接下來，在簡短的插曲中，我們更仔細地研究了先天稟賦的問題，以及這個問題可能怎樣限制了有些人在追求卓越時走得多遠。我們有些生理特徵確實是天生的，比如身高和體形，它們可能影響在各個體育專案以及其他體育活動中的表現，而且無法通過練習來改變。不過，更多的特點在傑出人物的卓越表現中發揮著作用，而它們是可以通過正確的練習來改變的，至少在人們一生中的某個階段可以改變。更一般地講，遺傳因素與練習活動之間存在著複雜的交織，而我們才剛剛開始瞭解。有些遺傳因素可能影響一個人投入到持久的刻意練習之中去的能力，例如，遺傳因素有可能限制某人每天都長時間集中注意力的能力。相反，進行大量練習，可能影響到身體中的基因怎樣開啟和關閉。本書的最後部分，讓我們從對傑出人物的研究中受益，特別是對刻意練習有了深入的瞭解，並解釋了這對我們其他人來說到底意味著什麼。圍繞怎樣將刻意練習應用到專業組織中的工作，以提高員工的績效，我提了一些具體的建議，同時還建議個人可以怎樣進行刻意練習，以便在他們感興趣的行業和領域中變得更加優秀，甚至還就學校可以怎樣在課堂中應用刻意練習提出了建議。儘管刻意練習的原則是通過研究傑出人物發現的，但這些原則本身，可以由任何立志於改進任何事情的人們所使用，即使只是稍稍改進也無妨。想提高你的網球水平嗎？刻意練習。寫作水平？刻意練習。銷售技能？刻意練習。由於研發刻意練習是專門用於幫助人們變成他們行業或領域中的世界最傑出人物，而不僅僅是變得“足夠好”，因此，這是迄今為止我們發現的最強大的學習方法。你可以從這個角度來思考：假設你想去爬山，你不確定你想爬多高，山路看起來蜿蜒曲折，令人望而生畏，但你知道，你想比現在所處的位置爬得更高一些。你可以簡單地選擇一條看起來很有希望的路徑，並期望是最好的，但你可能走不了很遠。或者，你可以依靠一個曾登上過頂峰、並瞭解最佳路線的嚮導，不論你決定自己要爬多高，這會保證你以最有效的方式登山。這種最佳的方法就是刻意練習，而本書就是你的嚮導。本書將向你顯示登上巔峰的路徑；至於在那條路徑上能走多遠，則取決於你自己。"
}